iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDE:1;
      uint64_t EOC:1;
      uint64_t EOIC:1;
      uint64_t STIC:1;
      uint64_t STRC:1;
      uint64_t ROVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDCHSEL:5;
      uint64_t EOCIE:1;
      uint64_t WDEIE:1;
      uint64_t EOICIE:1;
      uint64_t SM:1;
      uint64_t WDSC:1;
      uint64_t ICA:1;
      uint64_t DISRC:1;
      uint64_t DISIC:1;
      uint64_t DISNUM:3;
      uint64_t reservedSpace0:6;
      uint64_t IWDEN:1;
      uint64_t RWDEN:1;
      uint64_t DRES:2;
      uint64_t ROVFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCON:1;
      uint64_t CTN:1;
      uint64_t CLB:1;
      uint64_t RSTCLB:1;
      uint64_t reservedSpace0:4;
      uint64_t DMA:1;
      uint64_t DDM:1;
      uint64_t EOCM:1;
      uint64_t DAL:1;
      uint64_t reservedSpace1:4;
      uint64_t ETSIC:4;
      uint64_t ETMIC:2;
      uint64_t SWICST:1;
      uint64_t reservedSpace2:1;
      uint64_t ETSRC:4;
      uint64_t ETMRC:2;
      uint64_t SWRCST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPT10:3;
      uint64_t SPT11:3;
      uint64_t SPT12:3;
      uint64_t SPT13:3;
      uint64_t SPT14:3;
      uint64_t SPT15:3;
      uint64_t SPT16:3;
      uint64_t SPT17:3;
      uint64_t SPT18:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPT0:3;
      uint64_t SPT1:3;
      uint64_t SPT2:3;
      uint64_t SPT3:3;
      uint64_t SPT4:3;
      uint64_t SPT5:3;
      uint64_t SPT6:3;
      uint64_t SPT7:3;
      uint64_t SPT8:3;
      uint64_t SPT9:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDHT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDHT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDLT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ12:5;
      uint64_t RSQ13:5;
      uint64_t RSQ14:5;
      uint64_t RSQ15:5;
      uint64_t RL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ6:5;
      uint64_t RSQ7:5;
      uint64_t RSQ8:5;
      uint64_t RSQ9:5;
      uint64_t RSQ10:5;
      uint64_t RSQ11:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ0:5;
      uint64_t RSQ1:5;
      uint64_t RSQ2:5;
      uint64_t RSQ3:5;
      uint64_t RSQ4:5;
      uint64_t RSQ5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISQ0:5;
      uint64_t ISQ1:5;
      uint64_t ISQ2:5;
      uint64_t ISQ3:5;
      uint64_t IL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDATA;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVSEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSR:3;
      uint64_t OVSS:4;
      uint64_t TOVS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVSAMPCTL;

