iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define ADC0 (*(volatile struct ADC0_tag *) 0x40012000)

struct ADC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDE:1;
      uint64_t EOC:1;
      uint64_t EOIC:1;
      uint64_t STIC:1;
      uint64_t STRC:1;
      uint64_t ROVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDCHSEL:5;
      uint64_t EOCIE:1;
      uint64_t WDEIE:1;
      uint64_t EOICIE:1;
      uint64_t SM:1;
      uint64_t WDSC:1;
      uint64_t ICA:1;
      uint64_t DISRC:1;
      uint64_t DISIC:1;
      uint64_t DISNUM:3;
      uint64_t reservedSpace0:6;
      uint64_t IWDEN:1;
      uint64_t RWDEN:1;
      uint64_t DRES:2;
      uint64_t ROVFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCON:1;
      uint64_t CTN:1;
      uint64_t CLB:1;
      uint64_t RSTCLB:1;
      uint64_t reservedSpace0:4;
      uint64_t DMA:1;
      uint64_t DDM:1;
      uint64_t EOCM:1;
      uint64_t DAL:1;
      uint64_t reservedSpace1:4;
      uint64_t ETSIC:4;
      uint64_t ETMIC:2;
      uint64_t SWICST:1;
      uint64_t reservedSpace2:1;
      uint64_t ETSRC:4;
      uint64_t ETMRC:2;
      uint64_t SWRCST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPT10:3;
      uint64_t SPT11:3;
      uint64_t SPT12:3;
      uint64_t SPT13:3;
      uint64_t SPT14:3;
      uint64_t SPT15:3;
      uint64_t SPT16:3;
      uint64_t SPT17:3;
      uint64_t SPT18:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPT0:3;
      uint64_t SPT1:3;
      uint64_t SPT2:3;
      uint64_t SPT3:3;
      uint64_t SPT4:3;
      uint64_t SPT5:3;
      uint64_t SPT6:3;
      uint64_t SPT7:3;
      uint64_t SPT8:3;
      uint64_t SPT9:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDHT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDHT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDLT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ12:5;
      uint64_t RSQ13:5;
      uint64_t RSQ14:5;
      uint64_t RSQ15:5;
      uint64_t RL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ6:5;
      uint64_t RSQ7:5;
      uint64_t RSQ8:5;
      uint64_t RSQ9:5;
      uint64_t RSQ10:5;
      uint64_t RSQ11:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ0:5;
      uint64_t RSQ1:5;
      uint64_t RSQ2:5;
      uint64_t RSQ3:5;
      uint64_t RSQ4:5;
      uint64_t RSQ5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISQ0:5;
      uint64_t ISQ1:5;
      uint64_t ISQ2:5;
      uint64_t ISQ3:5;
      uint64_t IL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDATA;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVSEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSR:3;
      uint64_t OVSS:4;
      uint64_t TOVS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVSAMPCTL;

};

#define ADC1 (*(volatile struct ADC1_tag *) 0x40012100)

struct ADC2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDE:1;
      uint64_t EOC:1;
      uint64_t EOIC:1;
      uint64_t STIC:1;
      uint64_t STRC:1;
      uint64_t ROVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDCHSEL:5;
      uint64_t EOCIE:1;
      uint64_t WDEIE:1;
      uint64_t EOICIE:1;
      uint64_t SM:1;
      uint64_t WDSC:1;
      uint64_t ICA:1;
      uint64_t DISRC:1;
      uint64_t DISIC:1;
      uint64_t DISNUM:3;
      uint64_t reservedSpace0:6;
      uint64_t IWDEN:1;
      uint64_t RWDEN:1;
      uint64_t DRES:2;
      uint64_t ROVFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCON:1;
      uint64_t CTN:1;
      uint64_t CLB:1;
      uint64_t RSTCLB:1;
      uint64_t reservedSpace0:4;
      uint64_t DMA:1;
      uint64_t DDM:1;
      uint64_t EOCM:1;
      uint64_t DAL:1;
      uint64_t reservedSpace1:4;
      uint64_t ETSIC:4;
      uint64_t ETMIC:2;
      uint64_t SWICST:1;
      uint64_t reservedSpace2:1;
      uint64_t ETSRC:4;
      uint64_t ETMRC:2;
      uint64_t SWRCST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPT10:3;
      uint64_t SPT11:3;
      uint64_t SPT12:3;
      uint64_t SPT13:3;
      uint64_t SPT14:3;
      uint64_t SPT15:3;
      uint64_t SPT16:3;
      uint64_t SPT17:3;
      uint64_t SPT18:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPT0:3;
      uint64_t SPT1:3;
      uint64_t SPT2:3;
      uint64_t SPT3:3;
      uint64_t SPT4:3;
      uint64_t SPT5:3;
      uint64_t SPT6:3;
      uint64_t SPT7:3;
      uint64_t SPT8:3;
      uint64_t SPT9:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOFF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDHT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDHT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDLT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ12:5;
      uint64_t RSQ13:5;
      uint64_t RSQ14:5;
      uint64_t RSQ15:5;
      uint64_t RL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ6:5;
      uint64_t RSQ7:5;
      uint64_t RSQ8:5;
      uint64_t RSQ9:5;
      uint64_t RSQ10:5;
      uint64_t RSQ11:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSQ0:5;
      uint64_t RSQ1:5;
      uint64_t RSQ2:5;
      uint64_t RSQ3:5;
      uint64_t RSQ4:5;
      uint64_t RSQ5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSQ2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISQ0:5;
      uint64_t ISQ1:5;
      uint64_t ISQ2:5;
      uint64_t ISQ3:5;
      uint64_t IL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATAn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDATA;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVSEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSR:3;
      uint64_t OVSS:4;
      uint64_t TOVS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVSAMPCTL;

