iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS0:1;
      uint64_t FS1:1;
      uint64_t FS2:1;
      uint64_t FS3:1;
      uint64_t FS4:1;
      uint64_t FS5:1;
      uint64_t FS6:1;
      uint64_t FS7:1;
      uint64_t FS8:1;
      uint64_t FS9:1;
      uint64_t FS10:1;
      uint64_t FS11:1;
      uint64_t FS12:1;
      uint64_t FS13:1;
      uint64_t FS14:1;
      uint64_t FS15:1;
      uint64_t FS16:1;
      uint64_t FS17:1;
      uint64_t FS18:1;
      uint64_t FS19:1;
      uint64_t FS20:1;
      uint64_t FS21:1;
      uint64_t FS22:1;
      uint64_t FS23:1;
      uint64_t FS24:1;
      uint64_t FS25:1;
      uint64_t FS26:1;
      uint64_t FS27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSCFG;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAF0:1;
      uint64_t FAF1:1;
      uint64_t FAF2:1;
      uint64_t FAF3:1;
      uint64_t FAF4:1;
      uint64_t FAF5:1;
      uint64_t FAF6:1;
      uint64_t FAF7:1;
      uint64_t FAF8:1;
      uint64_t FAF9:1;
      uint64_t FAF10:1;
      uint64_t FAF11:1;
      uint64_t FAF12:1;
      uint64_t FAF13:1;
      uint64_t FAF14:1;
      uint64_t FAF15:1;
      uint64_t FAF16:1;
      uint64_t FAF17:1;
      uint64_t FAF18:1;
      uint64_t FAF19:1;
      uint64_t FAF20:1;
      uint64_t FAF21:1;
      uint64_t FAF22:1;
      uint64_t FAF23:1;
      uint64_t FAF24:1;
      uint64_t FAF25:1;
      uint64_t FAF26:1;
      uint64_t FAF27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FAFIFO;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FW0:1;
      uint64_t FW1:1;
      uint64_t FW2:1;
      uint64_t FW3:1;
      uint64_t FW4:1;
      uint64_t FW5:1;
      uint64_t FW6:1;
      uint64_t FW7:1;
      uint64_t FW8:1;
      uint64_t FW9:1;
      uint64_t FW10:1;
      uint64_t FW11:1;
      uint64_t FW12:1;
      uint64_t FW13:1;
      uint64_t FW14:1;
      uint64_t FW15:1;
      uint64_t FW16:1;
      uint64_t FW17:1;
      uint64_t FW18:1;
      uint64_t FW19:1;
      uint64_t FW20:1;
      uint64_t FW21:1;
      uint64_t FW22:1;
      uint64_t FW23:1;
      uint64_t FW24:1;
      uint64_t FW25:1;
      uint64_t FW26:1;
      uint64_t FW27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FW;

  uint8_t res5[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F2DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F2DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F3DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F3DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F4DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F4DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F5DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F5DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F6DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F6DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F7DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F7DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F8DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F8DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F9DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F9DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F10DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F10DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F11DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F11DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F12DATA0;

