iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F26DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F27DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F27DATA1;

};

#define CAN0 (*(volatile struct CAN0_tag *) 0x40006400)

struct CAN1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IWMOD:1;
      uint64_t SLPWMOD:1;
      uint64_t TFO:1;
      uint64_t RFOD:1;
      uint64_t ARD:1;
      uint64_t AWU:1;
      uint64_t ABOR:1;
      uint64_t TTC:1;
      uint64_t reservedSpace0:7;
      uint64_t SWRST:1;
      uint64_t DFZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IWS:1;
      uint64_t SLPWS:1;
      uint64_t ERRIF:1;
      uint64_t WUIF:1;
      uint64_t SLPIF:1;
      uint64_t reservedSpace0:3;
      uint64_t TS:1;
      uint64_t RS:1;
      uint64_t LASTRX:1;
      uint64_t RXL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTF0:1;
      uint64_t MTFNERR0:1;
      uint64_t MAL0:1;
      uint64_t MTE0:1;
      uint64_t reservedSpace0:3;
      uint64_t MST0:1;
      uint64_t MTF1:1;
      uint64_t MTFNERR1:1;
      uint64_t MAL1:1;
      uint64_t MTE1:1;
      uint64_t reservedSpace1:3;
      uint64_t MST1:1;
      uint64_t MTF2:1;
      uint64_t MTFNERR2:1;
      uint64_t MAL2:1;
      uint64_t MTE2:1;
      uint64_t reservedSpace2:3;
      uint64_t MST2:1;
      uint64_t NUM:2;
      uint64_t TME0:1;
      uint64_t TME1:1;
      uint64_t TME2:1;
      uint64_t TMLS0:1;
      uint64_t TMLS1:1;
      uint64_t TMLS2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFL0:2;
      uint64_t reservedSpace0:1;
      uint64_t RFF0:1;
      uint64_t RFO0:1;
      uint64_t RFD0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFL1:2;
      uint64_t reservedSpace0:1;
      uint64_t RFF1:1;
      uint64_t RFO1:1;
      uint64_t RFD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMEIE:1;
      uint64_t RFNEIE0:1;
      uint64_t RFFIE0:1;
      uint64_t RFOIE0:1;
      uint64_t RFNEIE1:1;
      uint64_t RFFIE1:1;
      uint64_t RFOIE1:1;
      uint64_t reservedSpace0:1;
      uint64_t WERRIE:1;
      uint64_t PERRIE:1;
      uint64_t BOIE:1;
      uint64_t ERRNIE:1;
      uint64_t reservedSpace1:3;
      uint64_t ERRIE:1;
      uint64_t WIE:1;
      uint64_t SLPWIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WERR:1;
      uint64_t PERR:1;
      uint64_t BOERR:1;
      uint64_t reservedSpace0:1;
      uint64_t ERRN:3;
      uint64_t reservedSpace1:9;
      uint64_t TECNT:8;
      uint64_t RECNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUADPSC:10;
      uint64_t reservedSpace0:6;
      uint64_t BS1:4;
      uint64_t BS2:3;
      uint64_t reservedSpace1:1;
      uint64_t SJW:2;
      uint64_t reservedSpace2:4;
      uint64_t LCMOD:1;
      uint64_t SCMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BT;

  uint8_t res0[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FT:1;
      uint64_t FF:1;
      uint64_t EFID:18;
      uint64_t SFID_EFID:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENC:4;
      uint64_t reservedSpace0:4;
      uint64_t TSEN:1;
      uint64_t reservedSpace1:7;
      uint64_t TS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB0:8;
      uint64_t DB1:8;
      uint64_t DB2:8;
      uint64_t DB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMDATA00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB4:8;
      uint64_t DB5:8;
      uint64_t DB6:8;
      uint64_t DB7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMDATA10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FT:1;
      uint64_t FF:1;
      uint64_t EFID:18;
      uint64_t SFID_EFID:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENC:4;
      uint64_t reservedSpace0:4;
      uint64_t TSEN:1;
      uint64_t reservedSpace1:7;
      uint64_t TS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB0:8;
      uint64_t DB1:8;
      uint64_t DB2:8;
      uint64_t DB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMDATA01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB4:8;
      uint64_t DB5:8;
      uint64_t DB6:8;
      uint64_t DB7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMDATA11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FT:1;
      uint64_t FF:1;
      uint64_t EFID:18;
      uint64_t SFID_EFID:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMI2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENC:4;
      uint64_t reservedSpace0:4;
      uint64_t TSEN:1;
      uint64_t reservedSpace1:7;
      uint64_t TS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB0:8;
      uint64_t DB1:8;
      uint64_t DB2:8;
      uint64_t DB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMDATA02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB4:8;
      uint64_t DB5:8;
      uint64_t DB6:8;
      uint64_t DB7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMDATA12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FT:1;
      uint64_t FF:1;
      uint64_t EFID:18;
      uint64_t SFID_EFID:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENC:4;
      uint64_t reservedSpace0:4;
      uint64_t FI:8;
      uint64_t TS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB0:8;
      uint64_t DB1:8;
      uint64_t DB2:8;
      uint64_t DB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMDATA00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB4:8;
      uint64_t DB5:8;
      uint64_t DB6:8;
      uint64_t DB7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMDATA10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FT:1;
      uint64_t FF:1;
      uint64_t EFID:18;
      uint64_t SFID_EFID:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENC:4;
      uint64_t reservedSpace0:4;
      uint64_t FI:8;
      uint64_t TS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB0:8;
      uint64_t DB1:8;
      uint64_t DB2:8;
      uint64_t DB3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMDATA01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DB4:8;
      uint64_t DB5:8;
      uint64_t DB6:8;
      uint64_t DB7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFIFOMDATA11;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLD:1;
      uint64_t reservedSpace0:7;
      uint64_t HBC1F:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMOD0:1;
      uint64_t FMOD1:1;
      uint64_t FMOD2:1;
      uint64_t FMOD3:1;
      uint64_t FMOD4:1;
      uint64_t FMOD5:1;
      uint64_t FMOD6:1;
      uint64_t FMOD7:1;
      uint64_t FMOD8:1;
      uint64_t FMOD9:1;
      uint64_t FMOD10:1;
      uint64_t FMOD11:1;
      uint64_t FMOD12:1;
      uint64_t FMOD13:1;
      uint64_t FMOD14:1;
      uint64_t FMOD15:1;
      uint64_t FMOD16:1;
      uint64_t FMOD17:1;
      uint64_t FMOD18:1;
      uint64_t FMOD19:1;
      uint64_t FMOD20:1;
      uint64_t FMOD21:1;
      uint64_t FMOD22:1;
      uint64_t FMOD23:1;
      uint64_t FMOD24:1;
      uint64_t FMOD25:1;
      uint64_t FMOD26:1;
      uint64_t FMOD27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMCFG;

