iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F12DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F13DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F13DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F14DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F14DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F15DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F15DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F16DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F16DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F17DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F17DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F18DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F18DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F19DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F19DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F20DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F20DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F21DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F21DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F22DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F22DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F23DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F23DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F24DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F24DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F25DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F25DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F26DATA0;

