iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F26DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F27DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD0:1;
      uint64_t FD1:1;
      uint64_t FD2:1;
      uint64_t FD3:1;
      uint64_t FD4:1;
      uint64_t FD5:1;
      uint64_t FD6:1;
      uint64_t FD7:1;
      uint64_t FD8:1;
      uint64_t FD9:1;
      uint64_t FD10:1;
      uint64_t FD11:1;
      uint64_t FD12:1;
      uint64_t FD13:1;
      uint64_t FD14:1;
      uint64_t FD15:1;
      uint64_t FD16:1;
      uint64_t FD17:1;
      uint64_t FD18:1;
      uint64_t FD19:1;
      uint64_t FD20:1;
      uint64_t FD21:1;
      uint64_t FD22:1;
      uint64_t FD23:1;
      uint64_t FD24:1;
      uint64_t FD25:1;
      uint64_t FD26:1;
      uint64_t FD27:1;
      uint64_t FD28:1;
      uint64_t FD29:1;
      uint64_t FD30:1;
      uint64_t FD31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F27DATA1;

};

#define CAN1 (*(volatile struct CAN1_tag *) 0x40006800)

struct CRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define CRC (*(volatile struct CRC_tag *) 0x40023000)

struct CTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKOKIE:1;
      uint64_t CKWARNIE:1;
      uint64_t ERRIE:1;
      uint64_t EREFIE:1;
      uint64_t reservedSpace0:1;
      uint64_t CNTEN:1;
      uint64_t AUTOTRIM:1;
      uint64_t SWREFPUL:1;
      uint64_t TRIMVALUE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLVALUE:16;
      uint64_t CKLIM:8;
      uint64_t REFPSC:3;
      uint64_t reservedSpace0:1;
      uint64_t REFSEL:2;
      uint64_t USBSOFSEL:1;
      uint64_t REFPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKOKIF:1;
      uint64_t CKWARNIF:1;
      uint64_t ERRIF:1;
      uint64_t EREFIF:1;
      uint64_t reservedSpace0:4;
      uint64_t CKERR:1;
      uint64_t REFMISS:1;
      uint64_t TRIMERR:1;
      uint64_t reservedSpace1:4;
      uint64_t REFDIR:1;
      uint64_t REFCAP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKOKIC:1;
      uint64_t CKWARNIC:1;
      uint64_t ERRIC:1;
      uint64_t EREFIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC;

};

#define CTC (*(volatile struct CTC_tag *) 0x40006c00)

struct DAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN0:1;
      uint64_t DBOFF0:1;
      uint64_t DTEN0:1;
      uint64_t DTSEL0:3;
      uint64_t DWM0:2;
      uint64_t DWBW0:4;
      uint64_t DDMAEN0:1;
      uint64_t DDUDRIE0:1;
      uint64_t reservedSpace0:2;
      uint64_t DEN1:1;
      uint64_t DBOFF1:1;
      uint64_t DTEN1:1;
      uint64_t DTSEL1:3;
      uint64_t DWM1:2;
      uint64_t DWBW1:4;
      uint64_t DDMAEN1:1;
      uint64_t DDUDRIE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWTR0:1;
      uint64_t SWTR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC0_DH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0_R12DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DAC0_DH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0_L12DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC0_DH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0_R8DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC1_DH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1_R12DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DAC1_DH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1_L12DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC1_DH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1_R8DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC0_DH:12;
      uint64_t reservedSpace0:4;
      uint64_t DAC1_DH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_R12DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DAC0_DH:12;
      uint64_t reservedSpace1:4;
      uint64_t DAC1_DH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_L12DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC0_DH:8;
      uint64_t DAC1_DH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_R8DH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC0_DO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0_DO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC1_DO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1_DO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t DDUDR0:1;
      uint64_t reservedSpace1:15;
      uint64_t DDUDR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

