iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define DAC (*(volatile struct DAC_tag *) 0x40007400)

struct DBG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID_CODE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLP_HOLD:1;
      uint64_t DSLP_HOLD:1;
      uint64_t STB_HOLD:1;
      uint64_t reservedSpace0:2;
      uint64_t TRACE_IOEN:1;
      uint64_t TRACE_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1_HOLD:1;
      uint64_t TIMER2_HOLD:1;
      uint64_t TIMER3_HOLD:1;
      uint64_t TIMER4_HOLD:1;
      uint64_t TIMER5_HOLD:1;
      uint64_t TIMER6_HOLD:1;
      uint64_t TIMER11_HOLD:1;
      uint64_t TIMER12_HOLD:1;
      uint64_t TIMER13_HOLD:1;
      uint64_t reservedSpace0:1;
      uint64_t RTC_HOLD:1;
      uint64_t WWDGT_HOLD:1;
      uint64_t FWDGT_HOLD:1;
      uint64_t reservedSpace1:8;
      uint64_t I2C0_HOLD:1;
      uint64_t I2C1_HOLD:1;
      uint64_t I2C2_HOLD:1;
      uint64_t reservedSpace2:1;
      uint64_t CAN0_HOLD:1;
      uint64_t CAN1_HOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0_HOLD:1;
      uint64_t TIMER7_HOLD:1;
      uint64_t reservedSpace0:14;
      uint64_t TIMER8_HOLD:1;
      uint64_t TIMER9_HOLD:1;
      uint64_t TIMER10_HOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

};

#define DBG (*(volatile struct DBG_tag *) 0xe0042000)

struct DCI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:1;
      uint64_t SNAP:1;
      uint64_t WDEN:1;
      uint64_t JM:1;
      uint64_t ESM:1;
      uint64_t CKS:1;
      uint64_t HPS:1;
      uint64_t VPS:1;
      uint64_t FR:2;
      uint64_t DCIF:2;
      uint64_t reservedSpace0:2;
      uint64_t DCIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HS:1;
      uint64_t VS:1;
      uint64_t FV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFF:1;
      uint64_t OVRF:1;
      uint64_t ESEF:1;
      uint64_t VSF:1;
      uint64_t ELF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFIE:1;
      uint64_t OVRIE:1;
      uint64_t ESEIE:1;
      uint64_t VSIE:1;
      uint64_t ELIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFIF:1;
      uint64_t OVRIF:1;
      uint64_t ESEIF:1;
      uint64_t VSIF:1;
      uint64_t ELIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFC:1;
      uint64_t OVRFC:1;
      uint64_t ESEFC:1;
      uint64_t VSFC:1;
      uint64_t ELFC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FS:8;
      uint64_t LS:8;
      uint64_t LE:8;
      uint64_t FE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM:8;
      uint64_t LSM:8;
      uint64_t LEM:8;
      uint64_t FEM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCUMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHSP:14;
      uint64_t reservedSpace0:2;
      uint64_t WVSP:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHSZ:14;
      uint64_t reservedSpace0:2;
      uint64_t WVSZ:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DT0:8;
      uint64_t DT1:8;
      uint64_t DT2:8;
      uint64_t DT3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

};

#define DCI (*(volatile struct DCI_tag *) 0x50050000)

struct DMA0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIF0:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIF0:1;
      uint64_t TAEIF0:1;
      uint64_t HTFIF0:1;
      uint64_t FTFIF0:1;
      uint64_t FEEIF1:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIF1:1;
      uint64_t TAEIF1:1;
      uint64_t HTFIF1:1;
      uint64_t FTFIF1:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIF2:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIF2:1;
      uint64_t TAEIF2:1;
      uint64_t HTFIF2:1;
      uint64_t FTFIF2:1;
      uint64_t FEEIF3:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIF3:1;
      uint64_t TAEIF3:1;
      uint64_t HTFIF3:1;
      uint64_t FTFIF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIF4:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIF4:1;
      uint64_t TAEIF4:1;
      uint64_t HTFIF4:1;
      uint64_t FTFIF4:1;
      uint64_t FEEIF5:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIF5:1;
      uint64_t TAEIF5:1;
      uint64_t HTFIF5:1;
      uint64_t FTFIF5:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIF6:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIF6:1;
      uint64_t TAEIF6:1;
      uint64_t HTFIF6:1;
      uint64_t FTFIF6:1;
      uint64_t FEEIF7:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIF7:1;
      uint64_t TAEIF7:1;
      uint64_t HTFIF7:1;
      uint64_t FTFIF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIFC0:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIFC0:1;
      uint64_t TAEIFC0:1;
      uint64_t HTFIFC0:1;
      uint64_t FTFIFC0:1;
      uint64_t FEEIFC1:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIFC1:1;
      uint64_t TAEIFC1:1;
      uint64_t HTFIFC1:1;
      uint64_t FTFIFC1:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIFC2:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIFC2:1;
      uint64_t TAEIFC2:1;
      uint64_t HTFIFC2:1;
      uint64_t FTFIFC2:1;
      uint64_t FEEIFC3:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIFC3:1;
      uint64_t TAEIFC3:1;
      uint64_t HTFIFC3:1;
      uint64_t FTFIFC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIFC4:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIFC4:1;
      uint64_t TAEIFC4:1;
      uint64_t HTFIFC4:1;
      uint64_t FTFIFC4:1;
      uint64_t FEEIFC5:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIFC5:1;
      uint64_t TAEIFC5:1;
      uint64_t HTFIFC5:1;
      uint64_t FTFIFC5:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIFC6:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIFC6:1;
      uint64_t TAEIFC6:1;
      uint64_t HTFIFC6:1;
      uint64_t FTFIFC6:1;
      uint64_t FEEIFC7:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIFC7:1;
      uint64_t TAEIFC7:1;
      uint64_t HTFIFC7:1;
      uint64_t FTFIFC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7FCTL;

