iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define DMA0 (*(volatile struct DMA0_tag *) 0x40026000)

struct DMA1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIF0:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIF0:1;
      uint64_t TAEIF0:1;
      uint64_t HTFIF0:1;
      uint64_t FTFIF0:1;
      uint64_t FEEIF1:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIF1:1;
      uint64_t TAEIF1:1;
      uint64_t HTFIF1:1;
      uint64_t FTFIF1:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIF2:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIF2:1;
      uint64_t TAEIF2:1;
      uint64_t HTFIF2:1;
      uint64_t FTFIF2:1;
      uint64_t FEEIF3:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIF3:1;
      uint64_t TAEIF3:1;
      uint64_t HTFIF3:1;
      uint64_t FTFIF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIF4:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIF4:1;
      uint64_t TAEIF4:1;
      uint64_t HTFIF4:1;
      uint64_t FTFIF4:1;
      uint64_t FEEIF5:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIF5:1;
      uint64_t TAEIF5:1;
      uint64_t HTFIF5:1;
      uint64_t FTFIF5:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIF6:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIF6:1;
      uint64_t TAEIF6:1;
      uint64_t HTFIF6:1;
      uint64_t FTFIF6:1;
      uint64_t FEEIF7:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIF7:1;
      uint64_t TAEIF7:1;
      uint64_t HTFIF7:1;
      uint64_t FTFIF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIFC0:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIFC0:1;
      uint64_t TAEIFC0:1;
      uint64_t HTFIFC0:1;
      uint64_t FTFIFC0:1;
      uint64_t FEEIFC1:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIFC1:1;
      uint64_t TAEIFC1:1;
      uint64_t HTFIFC1:1;
      uint64_t FTFIFC1:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIFC2:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIFC2:1;
      uint64_t TAEIFC2:1;
      uint64_t HTFIFC2:1;
      uint64_t FTFIFC2:1;
      uint64_t FEEIFC3:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIFC3:1;
      uint64_t TAEIFC3:1;
      uint64_t HTFIFC3:1;
      uint64_t FTFIFC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEIFC4:1;
      uint64_t reservedSpace0:1;
      uint64_t SDEIFC4:1;
      uint64_t TAEIFC4:1;
      uint64_t HTFIFC4:1;
      uint64_t FTFIFC4:1;
      uint64_t FEEIFC5:1;
      uint64_t reservedSpace1:1;
      uint64_t SDEIFC5:1;
      uint64_t TAEIFC5:1;
      uint64_t HTFIFC5:1;
      uint64_t FTFIFC5:1;
      uint64_t reservedSpace2:4;
      uint64_t FEEIFC6:1;
      uint64_t reservedSpace3:1;
      uint64_t SDEIFC6:1;
      uint64_t TAEIFC6:1;
      uint64_t HTFIFC6:1;
      uint64_t FTFIFC6:1;
      uint64_t FEEIFC7:1;
      uint64_t reservedSpace4:1;
      uint64_t SDEIFC7:1;
      uint64_t TAEIFC7:1;
      uint64_t HTFIFC7:1;
      uint64_t FTFIFC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t SDEIE:1;
      uint64_t TAEIE:1;
      uint64_t HTFIE:1;
      uint64_t FTFIE:1;
      uint64_t TFCS:1;
      uint64_t TM:2;
      uint64_t CMEN:1;
      uint64_t PNAGA:1;
      uint64_t MNAGA:1;
      uint64_t PWIDTH:2;
      uint64_t MWIDTH:2;
      uint64_t PAIF:1;
      uint64_t PRIO:2;
      uint64_t SBMEN:1;
      uint64_t MBS:1;
      uint64_t reservedSpace0:1;
      uint64_t PBURST:2;
      uint64_t MBURST:2;
      uint64_t PERIEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7PADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7M0ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M1ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7M1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCCV:2;
      uint64_t MDMEN:1;
      uint64_t FCNT:3;
      uint64_t reservedSpace0:1;
      uint64_t FEEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7FCTL;

