iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define DMA1 (*(volatile struct DMA1_tag *) 0x40026400)

struct ENET_DMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t DAB:1;
      uint64_t DPSL:5;
      uint64_t DFM:1;
      uint64_t PGBL:6;
      uint64_t RTPR:2;
      uint64_t FB:1;
      uint64_t RXDP:6;
      uint64_t UIP:1;
      uint64_t FPBL:1;
      uint64_t AA:1;
      uint64_t MB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_BCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_RPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_RDTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TDTADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:1;
      uint64_t TPS:1;
      uint64_t TBU:1;
      uint64_t TJT:1;
      uint64_t RO:1;
      uint64_t TU:1;
      uint64_t RS:1;
      uint64_t RBU:1;
      uint64_t RPS:1;
      uint64_t RWT:1;
      uint64_t ET:1;
      uint64_t reservedSpace0:2;
      uint64_t FBE:1;
      uint64_t ER:1;
      uint64_t AI:1;
      uint64_t NI:1;
      uint64_t RP:3;
      uint64_t TP:3;
      uint64_t EB:3;
      uint64_t reservedSpace1:1;
      uint64_t MSC:1;
      uint64_t WUM:1;
      uint64_t TST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SRE:1;
      uint64_t OSF:1;
      uint64_t RTHC:2;
      uint64_t reservedSpace1:1;
      uint64_t FUF:1;
      uint64_t FERF:1;
      uint64_t reservedSpace2:5;
      uint64_t STE:1;
      uint64_t TTHC:3;
      uint64_t reservedSpace3:3;
      uint64_t FTF:1;
      uint64_t TSFD:1;
      uint64_t reservedSpace4:2;
      uint64_t DAFRF:1;
      uint64_t RSFD:1;
      uint64_t DTCERFD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIEN:1;
      uint64_t TPSIEN:1;
      uint64_t TBUIEN:1;
      uint64_t TJTIEN:1;
      uint64_t ROIEN:1;
      uint64_t TUIEN:1;
      uint64_t RIEN:1;
      uint64_t RBUIEN:1;
      uint64_t RPSIEN:1;
      uint64_t RWTIEN:1;
      uint64_t ETIEN:1;
      uint64_t reservedSpace0:2;
      uint64_t FBEIEN:1;
      uint64_t ERIEN:1;
      uint64_t AIEN:1;
      uint64_t NIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSFC:16;
      uint64_t reservedSpace0:1;
      uint64_t MSFA:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_MFBOCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDCFRS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_RSWDC;

  uint8_t res0[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CTDADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CRDADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CTBADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CRBADDR;

};

#define ENET_DMA (*(volatile struct ENET_DMA_tag *) 0x40029000)

struct ENET_MAC_FCTH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFA:3;
      uint64_t reservedSpace0:1;
      uint64_t RFD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FCTH;

};

#define ENET_MAC_FCTH (*(volatile struct ENET_MAC_FCTH_tag *) 0x40029080)

struct ENET_MAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t DFC:1;
      uint64_t BOL:2;
      uint64_t APCD:1;
      uint64_t reservedSpace1:1;
      uint64_t RTD:1;
      uint64_t IPFCO:1;
      uint64_t DPM:1;
      uint64_t LBM:1;
      uint64_t ROD:1;
      uint64_t SPD:1;
      uint64_t reservedSpace2:1;
      uint64_t CSD:1;
      uint64_t IGBS:3;
      uint64_t reservedSpace3:2;
      uint64_t JBD:1;
      uint64_t WDD:1;
      uint64_t reservedSpace4:1;
      uint64_t TFCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PM:1;
      uint64_t HUF:1;
      uint64_t HMF:1;
      uint64_t DAIFLT:1;
      uint64_t MFD:1;
      uint64_t BFRMD:1;
      uint64_t PCFRM:2;
      uint64_t SAIFLT:1;
      uint64_t SAFLT:1;
      uint64_t HPFLT:1;
      uint64_t reservedSpace0:20;
      uint64_t FAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FRMF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HLH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HLL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PB:1;
      uint64_t PW:1;
      uint64_t CLR:3;
      uint64_t reservedSpace0:1;
      uint64_t PR:5;
      uint64_t PA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_PHY_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_PHY_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLCB_BKPA:1;
      uint64_t TFCEN:1;
      uint64_t RFCEN:1;
      uint64_t UPFDT:1;
      uint64_t PLTS:2;
      uint64_t reservedSpace0:1;
      uint64_t DZQP:1;
      uint64_t reservedSpace1:8;
      uint64_t PTM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLTI:16;
      uint64_t VLTC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VLT;

