iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res0[8];

  uint32_t MAC_RWFF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWD:1;
      uint64_t MPEN:1;
      uint64_t WFEN:1;
      uint64_t reservedSpace0:2;
      uint64_t MPKR:1;
      uint64_t WUFR:1;
      uint64_t reservedSpace1:2;
      uint64_t GU:1;
      uint64_t reservedSpace2:21;
      uint64_t WUFFRPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_WUM;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRNI:1;
      uint64_t RXAFS:2;
      uint64_t reservedSpace0:1;
      uint64_t RXFW:1;
      uint64_t RXFRS:2;
      uint64_t reservedSpace1:1;
      uint64_t RXFS:2;
      uint64_t reservedSpace2:6;
      uint64_t MTNI:1;
      uint64_t SOMT:2;
      uint64_t PCS:1;
      uint64_t TXFRS:2;
      uint64_t TXFW:1;
      uint64_t reservedSpace3:1;
      uint64_t TXFNE:1;
      uint64_t TXFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_DBG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t WUM:1;
      uint64_t MSC:1;
      uint64_t MSCR:1;
      uint64_t MSCT:1;
      uint64_t reservedSpace1:2;
      uint64_t TMST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t WUMIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TMSTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR0H:16;
      uint64_t reservedSpace0:15;
      uint64_t MO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR0H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR0L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR1H:16;
      uint64_t reservedSpace0:8;
      uint64_t MB:6;
      uint64_t SAF:1;
      uint64_t AFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR1L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR2H:16;
      uint64_t reservedSpace0:8;
      uint64_t MB:6;
      uint64_t SAF:1;
      uint64_t AFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR2H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR2L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR3H:16;
      uint64_t reservedSpace0:8;
      uint64_t MB:6;
      uint64_t SAF:1;
      uint64_t AFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR3H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR3L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDR3L;

};

#define ENET_MAC (*(volatile struct ENET_MAC_tag *) 0x40028000)

struct ENET_MSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:1;
      uint64_t CTSR:1;
      uint64_t RTOR:1;
      uint64_t MCFZ:1;
      uint64_t PMC:1;
      uint64_t AFHPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RFCE:1;
      uint64_t RFAE:1;
      uint64_t reservedSpace1:10;
      uint64_t RGUF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_RINTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t TGFSC:1;
      uint64_t TGFMSC:1;
      uint64_t reservedSpace1:5;
      uint64_t TGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_TINTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RFCEIM:1;
      uint64_t RFAEIM:1;
      uint64_t reservedSpace1:10;
      uint64_t RGUFIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_RINTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t TGFSCIM:1;
      uint64_t TGFMSCIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TGFIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_TINTMSK;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_SCCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_MSCCNT;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TGF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_TGFCNT;

  uint8_t res2[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFCER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_RFCECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFAER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_RFAECNT;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RGUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSC_RGUFCNT;

};

#define ENET_MSC (*(volatile struct ENET_MSC_tag *) 0x40028100)

struct ENET_PTP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMSEN:1;
      uint64_t TMSFCU:1;
      uint64_t TMSSTI:1;
      uint64_t TMSSTU:1;
      uint64_t TMSITEN:1;
      uint64_t TMSARU:1;
      uint64_t reservedSpace0:2;
      uint64_t ARFSEN:1;
      uint64_t SCROM:1;
      uint64_t PFSV:1;
      uint64_t ESEN:1;
      uint64_t IP6SEN:1;
      uint64_t IP4SEN:1;
      uint64_t ETMSEN:1;
      uint64_t MNMSEN:1;
      uint64_t CKNT:2;
      uint64_t MAFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STMSSI:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_SSINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STMS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STMSS:31;
      uint64_t STS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMSUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSUH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMSUSS:31;
      uint64_t TMSUPNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMSA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSADDEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETSH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_ETH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETSL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_ETL;

