iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSCO:1;
      uint64_t TTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSOFC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_PPSCTL;

};

#define ENET_PTP (*(volatile struct ENET_PTP_tag *) 0x40028700)

struct EXMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NRBKEN:1;
      uint64_t NRMUX:1;
      uint64_t NRTP:2;
      uint64_t NRW:2;
      uint64_t NREN:1;
      uint64_t reservedSpace0:1;
      uint64_t SBRSTEN:1;
      uint64_t NRWTPOL:1;
      uint64_t WRAPEN:1;
      uint64_t NRWTCFG:1;
      uint64_t WREN:1;
      uint64_t NRWTEN:1;
      uint64_t EXMODEN:1;
      uint64_t ASYNCWAIT:1;
      uint64_t CPS:3;
      uint64_t SYNCWR:1;
      uint64_t CCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASET:4;
      uint64_t AHLD:4;
      uint64_t DSET:8;
      uint64_t BUSLAT:4;
      uint64_t CKDIV:4;
      uint64_t DLAT:4;
      uint64_t ASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNTCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NRBKEN:1;
      uint64_t NRMUX:1;
      uint64_t NRTP:2;
      uint64_t NRW:2;
      uint64_t NREN:1;
      uint64_t reservedSpace0:1;
      uint64_t SBRSTEN:1;
      uint64_t NRWTPOL:1;
      uint64_t WRAPEN:1;
      uint64_t NRWTCFG:1;
      uint64_t WREN:1;
      uint64_t NRWTEN:1;
      uint64_t EXMODEN:1;
      uint64_t ASYNCWAIT:1;
      uint64_t CPS:3;
      uint64_t SYNCWR:1;
      uint64_t CCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASET:4;
      uint64_t AHLD:4;
      uint64_t DSET:8;
      uint64_t BUSLAT:4;
      uint64_t CKDIV:4;
      uint64_t DLAT:4;
      uint64_t ASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNTCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NRBKEN:1;
      uint64_t NRMUX:1;
      uint64_t NRTP:2;
      uint64_t NRW:2;
      uint64_t NREN:1;
      uint64_t reservedSpace0:1;
      uint64_t SBRSTEN:1;
      uint64_t NRWTPOL:1;
      uint64_t WRAPEN:1;
      uint64_t NRWTCFG:1;
      uint64_t WREN:1;
      uint64_t NRWTEN:1;
      uint64_t EXMODEN:1;
      uint64_t ASYNCWAIT:1;
      uint64_t CPS:3;
      uint64_t SYNCWR:1;
      uint64_t CCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASET:4;
      uint64_t AHLD:4;
      uint64_t DSET:8;
      uint64_t BUSLAT:4;
      uint64_t CKDIV:4;
      uint64_t DLAT:4;
      uint64_t ASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNTCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NRBKEN:1;
      uint64_t NRMUX:1;
      uint64_t NRTP:2;
      uint64_t NRW:2;
      uint64_t NREN:1;
      uint64_t reservedSpace0:1;
      uint64_t SBRSTEN:1;
      uint64_t NRWTPOL:1;
      uint64_t WRAPEN:1;
      uint64_t NRWTCFG:1;
      uint64_t WREN:1;
      uint64_t NRWTEN:1;
      uint64_t EXMODEN:1;
      uint64_t ASYNCWAIT:1;
      uint64_t CPS:3;
      uint64_t SYNCWR:1;
      uint64_t CCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNCTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASET:4;
      uint64_t AHLD:4;
      uint64_t DSET:8;
      uint64_t BUSLAT:4;
      uint64_t CKDIV:4;
      uint64_t DLAT:4;
      uint64_t ASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNTCFG3;

  uint8_t res0[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t NDWTEN:1;
      uint64_t NDBKEN:1;
      uint64_t NDTP:1;
      uint64_t NDW:2;
      uint64_t ECCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CTR:4;
      uint64_t ATR:4;
      uint64_t ECCSZ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTRS:1;
      uint64_t INTHS:1;
      uint64_t INTFS:1;
      uint64_t INTREN:1;
      uint64_t INTHEN:1;
      uint64_t INTFEN:1;
      uint64_t FFEPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPINTEN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMSET:8;
      uint64_t COMWAIT:8;
      uint64_t COMHLD:8;
      uint64_t COMHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCTCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATTSET:8;
      uint64_t ATTWAIT:8;
      uint64_t ATTHLD:8;
      uint64_t ATTHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPATCFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECC1;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t NDWTEN:1;
      uint64_t NDBKEN:1;
      uint64_t NDTP:1;
      uint64_t NDW:2;
      uint64_t ECCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CTR:4;
      uint64_t ATR:4;
      uint64_t ECCSZ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTRS:1;
      uint64_t INTHS:1;
      uint64_t INTFS:1;
      uint64_t INTREN:1;
      uint64_t INTHEN:1;
      uint64_t INTFEN:1;
      uint64_t FFEPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPINTEN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMSET:8;
      uint64_t COMWAIT:8;
      uint64_t COMHLD:8;
      uint64_t COMHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCTCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATTSET:8;
      uint64_t ATTWAIT:8;
      uint64_t ATTHLD:8;
      uint64_t ATTHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPATCFG2;

