iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECC2;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t NDWTEN:1;
      uint64_t NDBKEN:1;
      uint64_t NDTP:1;
      uint64_t NDW:2;
      uint64_t ECCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CTR:4;
      uint64_t ATR:4;
      uint64_t ECCSZ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTRS:1;
      uint64_t INTHS:1;
      uint64_t INTFS:1;
      uint64_t INTREN:1;
      uint64_t INTHEN:1;
      uint64_t INTFEN:1;
      uint64_t FFEPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPINTEN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMSET:8;
      uint64_t COMWAIT:8;
      uint64_t COMHLD:8;
      uint64_t COMHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCTCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATTSET:8;
      uint64_t ATTWAIT:8;
      uint64_t ATTHLD:8;
      uint64_t ATTHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPATCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOSET:8;
      uint64_t IOWAIT:8;
      uint64_t IOHLD:8;
      uint64_t IOHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOTCFG3;

  uint8_t res5[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WASET:4;
      uint64_t WAHLD:4;
      uint64_t WDSET:8;
      uint64_t WBUSLAT:4;
      uint64_t reservedSpace0:8;
      uint64_t WASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNWTCFG0;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WASET:4;
      uint64_t WAHLD:4;
      uint64_t WDSET:8;
      uint64_t WBUSLAT:4;
      uint64_t reservedSpace0:8;
      uint64_t WASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNWTCFG1;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WASET:4;
      uint64_t WAHLD:4;
      uint64_t WDSET:8;
      uint64_t WBUSLAT:4;
      uint64_t reservedSpace0:8;
      uint64_t WASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNWTCFG2;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WASET:4;
      uint64_t WAHLD:4;
      uint64_t WDSET:8;
      uint64_t WBUSLAT:4;
      uint64_t reservedSpace0:8;
      uint64_t WASYNCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNWTCFG3;

  uint8_t res9[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAW:2;
      uint64_t RAW:2;
      uint64_t SDW:2;
      uint64_t NBK:1;
      uint64_t CL:2;
      uint64_t WPEN:1;
      uint64_t SDCLK:2;
      uint64_t BRSTRD:1;
      uint64_t PIPED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAW:2;
      uint64_t RAW:2;
      uint64_t SDW:2;
      uint64_t NBK:1;
      uint64_t CL:2;
      uint64_t WPEN:1;
      uint64_t SDCLK:2;
      uint64_t BRSTRD:1;
      uint64_t PIPED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMRD:4;
      uint64_t XSRD:4;
      uint64_t RASD:4;
      uint64_t ARFD:4;
      uint64_t WRD:4;
      uint64_t RPD:4;
      uint64_t RCD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMRD:4;
      uint64_t XSRD:4;
      uint64_t RASD:4;
      uint64_t ARFD:4;
      uint64_t WRD:4;
      uint64_t RPD:4;
      uint64_t RCD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:3;
      uint64_t DS1:1;
      uint64_t DS0:1;
      uint64_t NARF:4;
      uint64_t MRC:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:1;
      uint64_t ARINTV:13;
      uint64_t REIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDARI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REIF:1;
      uint64_t STA0:2;
      uint64_t STA1:2;
      uint64_t NRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDSTAT;

  uint8_t res10[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSEN:1;
      uint64_t SSCR:1;
      uint64_t reservedSpace0:2;
      uint64_t SDSC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRSCTL;

  uint8_t res11[396];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CMDBIT:2;
      uint64_t reservedSpace1:6;
      uint64_t ADRBIT:5;
      uint64_t IDL:2;
      uint64_t POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINIT;

  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCMD:16;
      uint64_t RWAITCYCLE:4;
      uint64_t RMODE:2;
      uint64_t reservedSpace0:9;
      uint64_t RDID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCMD;

  uint8_t res13[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WCMD:15;
      uint64_t reservedSpace0:1;
      uint64_t WWAITCYCLE:4;
      uint64_t WMODE:2;
      uint64_t reservedSpace1:9;
      uint64_t SC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWCMD;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDL;

  uint8_t res15[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDH;

