iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define EXMC (*(volatile struct EXMC_tag *) 0xa0000000)

struct EXTI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN0:1;
      uint64_t INTEN1:1;
      uint64_t INTEN2:1;
      uint64_t INTEN3:1;
      uint64_t INTEN4:1;
      uint64_t INTEN5:1;
      uint64_t INTEN6:1;
      uint64_t INTEN7:1;
      uint64_t INTEN8:1;
      uint64_t INTEN9:1;
      uint64_t INTEN10:1;
      uint64_t INTEN11:1;
      uint64_t INTEN12:1;
      uint64_t INTEN13:1;
      uint64_t INTEN14:1;
      uint64_t INTEN15:1;
      uint64_t INTEN16:1;
      uint64_t INTEN17:1;
      uint64_t INTEN18:1;
      uint64_t INTEN19:1;
      uint64_t INTEN20:1;
      uint64_t INTEN21:1;
      uint64_t INTEN22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVEN0:1;
      uint64_t EVEN1:1;
      uint64_t EVEN2:1;
      uint64_t EVEN3:1;
      uint64_t EVEN4:1;
      uint64_t EVEN5:1;
      uint64_t EVEN6:1;
      uint64_t EVEN7:1;
      uint64_t EVEN8:1;
      uint64_t EVEN9:1;
      uint64_t EVEN10:1;
      uint64_t EVEN11:1;
      uint64_t EVEN12:1;
      uint64_t EVEN13:1;
      uint64_t EVEN14:1;
      uint64_t EVEN15:1;
      uint64_t EVEN16:1;
      uint64_t EVEN17:1;
      uint64_t EVEN18:1;
      uint64_t EVEN19:1;
      uint64_t EVEN20:1;
      uint64_t EVEN21:1;
      uint64_t EVEN22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTEN0:1;
      uint64_t RTEN1:1;
      uint64_t RTEN2:1;
      uint64_t RTEN3:1;
      uint64_t RTEN4:1;
      uint64_t RTEN5:1;
      uint64_t RTEN6:1;
      uint64_t RTEN7:1;
      uint64_t RTEN8:1;
      uint64_t RTEN9:1;
      uint64_t RTEN10:1;
      uint64_t RTEN11:1;
      uint64_t RTEN12:1;
      uint64_t RTEN13:1;
      uint64_t RTEN14:1;
      uint64_t RTEN15:1;
      uint64_t RTEN16:1;
      uint64_t RTEN17:1;
      uint64_t RTEN18:1;
      uint64_t RTEN19:1;
      uint64_t RTEN20:1;
      uint64_t RTEN21:1;
      uint64_t RTEN22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTEN0:1;
      uint64_t FTEN1:1;
      uint64_t FTEN2:1;
      uint64_t FTEN3:1;
      uint64_t FTEN4:1;
      uint64_t FTEN5:1;
      uint64_t FTEN6:1;
      uint64_t FTEN7:1;
      uint64_t FTEN8:1;
      uint64_t FTEN9:1;
      uint64_t FTEN10:1;
      uint64_t FTEN11:1;
      uint64_t FTEN12:1;
      uint64_t FTEN13:1;
      uint64_t FTEN14:1;
      uint64_t FTEN15:1;
      uint64_t FTEN16:1;
      uint64_t FTEN17:1;
      uint64_t FTEN18:1;
      uint64_t FTEN19:1;
      uint64_t FTEN20:1;
      uint64_t FTEN21:1;
      uint64_t FTEN22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWIEV0:1;
      uint64_t SWIEV1:1;
      uint64_t SWIEV2:1;
      uint64_t SWIEV3:1;
      uint64_t SWIEV4:1;
      uint64_t SWIEV5:1;
      uint64_t SWIEV6:1;
      uint64_t SWIEV7:1;
      uint64_t SWIEV8:1;
      uint64_t SWIEV9:1;
      uint64_t SWIEV10:1;
      uint64_t SWIEV11:1;
      uint64_t SWIEV12:1;
      uint64_t SWIEV13:1;
      uint64_t SWIEV14:1;
      uint64_t SWIEV15:1;
      uint64_t SWIEV16:1;
      uint64_t SWIEV17:1;
      uint64_t SWIEV18:1;
      uint64_t SWIEV19:1;
      uint64_t SWIEV20:1;
      uint64_t SWIEV21:1;
      uint64_t SWIEV22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
      uint64_t PD16:1;
      uint64_t PD17:1;
      uint64_t PD18:1;
      uint64_t PD19:1;
      uint64_t PD20:1;
      uint64_t PD21:1;
      uint64_t PD22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD;

};

#define EXTI (*(volatile struct EXTI_tag *) 0x40013c00)

struct FMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBKEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t END:1;
      uint64_t OPERR:1;
      uint64_t reservedSpace0:2;
      uint64_t WPERR:1;
      uint64_t reservedSpace1:1;
      uint64_t PGMERR:1;
      uint64_t PGSERR:1;
      uint64_t RDDERR:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:1;
      uint64_t SER:1;
      uint64_t MER0:1;
      uint64_t SN:5;
      uint64_t PSZ:2;
      uint64_t reservedSpace0:5;
      uint64_t MER1:1;
      uint64_t START:1;
      uint64_t reservedSpace1:7;
      uint64_t ENDIE:1;
      uint64_t ERRIE:1;
      uint64_t reservedSpace2:5;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OB_LK:1;
      uint64_t OB_START:1;
      uint64_t BOR_TH:2;
      uint64_t BB:1;
      uint64_t nWDG_HW:1;
      uint64_t nRST_DPSLP:1;
      uint64_t nRST_STDBY:1;
      uint64_t SPC:8;
      uint64_t WP0:12;
      uint64_t reservedSpace0:2;
      uint64_t DBS:1;
      uint64_t DRP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t WP1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBCTL1;

  uint8_t res0[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WSEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

