iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define GPIOA (*(volatile struct GPIOA_tag *) 0x40020000)

struct GPIOB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTL0:2;
      uint64_t CTL1:2;
      uint64_t CTL2:2;
      uint64_t CTL3:2;
      uint64_t CTL4:2;
      uint64_t CTL5:2;
      uint64_t CTL6:2;
      uint64_t CTL7:2;
      uint64_t CTL8:2;
      uint64_t CTL9:2;
      uint64_t CTL10:2;
      uint64_t CTL11:2;
      uint64_t CTL12:2;
      uint64_t CTL13:2;
      uint64_t CTL14:2;
      uint64_t CTL15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OM0:1;
      uint64_t OM1:1;
      uint64_t OM2:1;
      uint64_t OM3:1;
      uint64_t OM4:1;
      uint64_t OM5:1;
      uint64_t OM6:1;
      uint64_t OM7:1;
      uint64_t OM8:1;
      uint64_t OM9:1;
      uint64_t OM10:1;
      uint64_t OM11:1;
      uint64_t OM12:1;
      uint64_t OM13:1;
      uint64_t OM14:1;
      uint64_t OM15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSPD0:2;
      uint64_t OSPD1:2;
      uint64_t OSPD2:2;
      uint64_t OSPD3:2;
      uint64_t OSPD4:2;
      uint64_t OSPD5:2;
      uint64_t OSPD6:2;
      uint64_t OSPD7:2;
      uint64_t OSPD8:2;
      uint64_t OSPD9:2;
      uint64_t OSPD10:2;
      uint64_t OSPD11:2;
      uint64_t OSPD12:2;
      uint64_t OSPD13:2;
      uint64_t OSPD14:2;
      uint64_t OSPD15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUD0:2;
      uint64_t PUD1:2;
      uint64_t PUD2:2;
      uint64_t PUD3:2;
      uint64_t PUD4:2;
      uint64_t PUD5:2;
      uint64_t PUD6:2;
      uint64_t PUD7:2;
      uint64_t PUD8:2;
      uint64_t PUD9:2;
      uint64_t PUD10:2;
      uint64_t PUD11:2;
      uint64_t PUD12:2;
      uint64_t PUD13:2;
      uint64_t PUD14:2;
      uint64_t PUD15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISTAT0:1;
      uint64_t ISTAT1:1;
      uint64_t ISTAT2:1;
      uint64_t ISTAT3:1;
      uint64_t ISTAT4:1;
      uint64_t ISTAT5:1;
      uint64_t ISTAT6:1;
      uint64_t ISTAT7:1;
      uint64_t ISTAT8:1;
      uint64_t ISTAT9:1;
      uint64_t ISTAT10:1;
      uint64_t ISTAT11:1;
      uint64_t ISTAT12:1;
      uint64_t ISTAT13:1;
      uint64_t ISTAT14:1;
      uint64_t ISTAT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCTL0:1;
      uint64_t OCTL1:1;
      uint64_t OCTL2:1;
      uint64_t OCTL3:1;
      uint64_t OCTL4:1;
      uint64_t OCTL5:1;
      uint64_t OCTL6:1;
      uint64_t OCTL7:1;
      uint64_t OCTL8:1;
      uint64_t OCTL9:1;
      uint64_t OCTL10:1;
      uint64_t OCTL11:1;
      uint64_t OCTL12:1;
      uint64_t OCTL13:1;
      uint64_t OCTL14:1;
      uint64_t OCTL15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOP0:1;
      uint64_t BOP1:1;
      uint64_t BOP2:1;
      uint64_t BOP3:1;
      uint64_t BOP4:1;
      uint64_t BOP5:1;
      uint64_t BOP6:1;
      uint64_t BOP7:1;
      uint64_t BOP8:1;
      uint64_t BOP9:1;
      uint64_t BOP10:1;
      uint64_t BOP11:1;
      uint64_t BOP12:1;
      uint64_t BOP13:1;
      uint64_t BOP14:1;
      uint64_t BOP15:1;
      uint64_t CR0:1;
      uint64_t CR1:1;
      uint64_t CR2:1;
      uint64_t CR3:1;
      uint64_t CR4:1;
      uint64_t CR5:1;
      uint64_t CR6:1;
      uint64_t CR7:1;
      uint64_t CR8:1;
      uint64_t CR9:1;
      uint64_t CR10:1;
      uint64_t CR11:1;
      uint64_t CR12:1;
      uint64_t CR13:1;
      uint64_t CR14:1;
      uint64_t CR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LK0:1;
      uint64_t LK1:1;
      uint64_t LK2:1;
      uint64_t LK3:1;
      uint64_t LK4:1;
      uint64_t LK5:1;
      uint64_t LK6:1;
      uint64_t LK7:1;
      uint64_t LK8:1;
      uint64_t LK9:1;
      uint64_t LK10:1;
      uint64_t LK11:1;
      uint64_t LK12:1;
      uint64_t LK13:1;
      uint64_t LK14:1;
      uint64_t LK15:1;
      uint64_t LKK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:4;
      uint64_t SEL1:4;
      uint64_t SEL2:4;
      uint64_t SEL3:4;
      uint64_t SEL4:4;
      uint64_t SEL5:4;
      uint64_t SEL6:4;
      uint64_t SEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL8:4;
      uint64_t SEL9:4;
      uint64_t SEL10:4;
      uint64_t SEL11:4;
      uint64_t SEL12:4;
      uint64_t SEL13:4;
      uint64_t SEL14:4;
      uint64_t SEL15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR0:1;
      uint64_t CR1:1;
      uint64_t CR2:1;
      uint64_t CR3:1;
      uint64_t CR4:1;
      uint64_t CR5:1;
      uint64_t CR6:1;
      uint64_t CR7:1;
      uint64_t CR8:1;
      uint64_t CR9:1;
      uint64_t CR10:1;
      uint64_t CR11:1;
      uint64_t CR12:1;
      uint64_t CR13:1;
      uint64_t CR14:1;
      uint64_t CR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TG0:1;
      uint64_t TG1:1;
      uint64_t TG2:1;
      uint64_t TG3:1;
      uint64_t TG4:1;
      uint64_t TG5:1;
      uint64_t TG6:1;
      uint64_t TG7:1;
      uint64_t TG8:1;
      uint64_t TG9:1;
      uint64_t TG10:1;
      uint64_t TG11:1;
      uint64_t TG12:1;
      uint64_t TG13:1;
      uint64_t TG14:1;
      uint64_t TG15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG;

};

#define GPIOB (*(volatile struct GPIOB_tag *) 0x40020400)

