iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define GPIOI (*(volatile struct GPIOI_tag *) 0x40022000)

struct I2C0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2CEN:1;
      uint64_t SMBEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SMBSEL:1;
      uint64_t ARPEN:1;
      uint64_t PECEN:1;
      uint64_t GCEN:1;
      uint64_t DISSTRC:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACKEN:1;
      uint64_t POAP:1;
      uint64_t PECTRANS:1;
      uint64_t SALT:1;
      uint64_t reservedSpace1:1;
      uint64_t SRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2CCLK:6;
      uint64_t reservedSpace0:2;
      uint64_t ERRIE:1;
      uint64_t EVIE:1;
      uint64_t BUFIE:1;
      uint64_t DMAON:1;
      uint64_t DMALST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS0:1;
      uint64_t ADDRESS7_1:7;
      uint64_t ADDRESS9_8:2;
      uint64_t reservedSpace0:5;
      uint64_t ADDFORMAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUADEN:1;
      uint64_t ADDRESS2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBSEND:1;
      uint64_t ADDSEND:1;
      uint64_t BTC:1;
      uint64_t ADD10SEND:1;
      uint64_t STPDET:1;
      uint64_t reservedSpace0:1;
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t BERR:1;
      uint64_t LOSTARB:1;
      uint64_t AERR:1;
      uint64_t OUERR:1;
      uint64_t PECERR:1;
      uint64_t reservedSpace1:1;
      uint64_t SMBTO:1;
      uint64_t SMBALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t I2CBSY:1;
      uint64_t TRS:1;
      uint64_t reservedSpace0:1;
      uint64_t RXGC:1;
      uint64_t DEFSMB:1;
      uint64_t HSTSMB:1;
      uint64_t DUMODF:1;
      uint64_t ECV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKC:12;
      uint64_t reservedSpace0:2;
      uint64_t DTCY:1;
      uint64_t FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RISETIME:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DF:4;
      uint64_t AFD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCTL;

  uint8_t res0[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMEN:1;
      uint64_t STOEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TFFIE:1;
      uint64_t TFRIE:1;
      uint64_t RFFIE:1;
      uint64_t RFRIE:1;
      uint64_t TXF:1;
      uint64_t RXF:1;
      uint64_t reservedSpace1:2;
      uint64_t TFF:1;
      uint64_t TFR:1;
      uint64_t RFF:1;
      uint64_t RFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMCS;

};

#define I2C0 (*(volatile struct I2C0_tag *) 0x40005400)

struct I2C1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2CEN:1;
      uint64_t SMBEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SMBSEL:1;
      uint64_t ARPEN:1;
      uint64_t PECEN:1;
      uint64_t GCEN:1;
      uint64_t DISSTRC:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACKEN:1;
      uint64_t POAP:1;
      uint64_t PECTRANS:1;
      uint64_t SALT:1;
      uint64_t reservedSpace1:1;
      uint64_t SRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2CCLK:6;
      uint64_t reservedSpace0:2;
      uint64_t ERRIE:1;
      uint64_t EVIE:1;
      uint64_t BUFIE:1;
      uint64_t DMAON:1;
      uint64_t DMALST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS0:1;
      uint64_t ADDRESS7_1:7;
      uint64_t ADDRESS9_8:2;
      uint64_t reservedSpace0:5;
      uint64_t ADDFORMAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUADEN:1;
      uint64_t ADDRESS2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBSEND:1;
      uint64_t ADDSEND:1;
      uint64_t BTC:1;
      uint64_t ADD10SEND:1;
      uint64_t STPDET:1;
      uint64_t reservedSpace0:1;
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t BERR:1;
      uint64_t LOSTARB:1;
      uint64_t AERR:1;
      uint64_t OUERR:1;
      uint64_t PECERR:1;
      uint64_t reservedSpace1:1;
      uint64_t SMBTO:1;
      uint64_t SMBALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t I2CBSY:1;
      uint64_t TRS:1;
      uint64_t reservedSpace0:1;
      uint64_t RXGC:1;
      uint64_t DEFSMB:1;
      uint64_t HSTSMB:1;
      uint64_t DUMODF:1;
      uint64_t ECV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKC:12;
      uint64_t reservedSpace0:2;
      uint64_t DTCY:1;
      uint64_t FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RISETIME:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DF:4;
      uint64_t AFD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCTL;

  uint8_t res0[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMEN:1;
      uint64_t STOEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TFFIE:1;
      uint64_t TFRIE:1;
      uint64_t RFFIE:1;
      uint64_t RFRIE:1;
      uint64_t TXF:1;
      uint64_t RXF:1;
      uint64_t reservedSpace1:2;
      uint64_t TFF:1;
      uint64_t TFR:1;
      uint64_t RFF:1;
      uint64_t RFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMCS;

