iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define I2C1 (*(volatile struct I2C1_tag *) 0x40005800)

struct I2C2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2CEN:1;
      uint64_t SMBEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SMBSEL:1;
      uint64_t ARPEN:1;
      uint64_t PECEN:1;
      uint64_t GCEN:1;
      uint64_t DISSTRC:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACKEN:1;
      uint64_t POAP:1;
      uint64_t PECTRANS:1;
      uint64_t SALT:1;
      uint64_t reservedSpace1:1;
      uint64_t SRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2CCLK:6;
      uint64_t reservedSpace0:2;
      uint64_t ERRIE:1;
      uint64_t EVIE:1;
      uint64_t BUFIE:1;
      uint64_t DMAON:1;
      uint64_t DMALST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS0:1;
      uint64_t ADDRESS7_1:7;
      uint64_t ADDRESS9_8:2;
      uint64_t reservedSpace0:5;
      uint64_t ADDFORMAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUADEN:1;
      uint64_t ADDRESS2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBSEND:1;
      uint64_t ADDSEND:1;
      uint64_t BTC:1;
      uint64_t ADD10SEND:1;
      uint64_t STPDET:1;
      uint64_t reservedSpace0:1;
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t BERR:1;
      uint64_t LOSTARB:1;
      uint64_t AERR:1;
      uint64_t OUERR:1;
      uint64_t PECERR:1;
      uint64_t reservedSpace1:1;
      uint64_t SMBTO:1;
      uint64_t SMBALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t I2CBSY:1;
      uint64_t TRS:1;
      uint64_t reservedSpace0:1;
      uint64_t RXGC:1;
      uint64_t DEFSMB:1;
      uint64_t HSTSMB:1;
      uint64_t DUMODF:1;
      uint64_t ECV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKC:12;
      uint64_t reservedSpace0:2;
      uint64_t DTCY:1;
      uint64_t FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RISETIME:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DF:4;
      uint64_t AFD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCTL;

  uint8_t res0[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMEN:1;
      uint64_t STOEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TFFIE:1;
      uint64_t TFRIE:1;
      uint64_t RFFIE:1;
      uint64_t RFRIE:1;
      uint64_t TXF:1;
      uint64_t RXF:1;
      uint64_t reservedSpace1:2;
      uint64_t TFF:1;
      uint64_t TFR:1;
      uint64_t RFF:1;
      uint64_t RFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMCS;

};

#define I2C2 (*(volatile struct I2C2_tag *) 0x40005c00)

struct IREF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSDT:6;
      uint64_t reservedSpace0:1;
      uint64_t SCMOD:1;
      uint64_t CPT:5;
      uint64_t reservedSpace1:1;
      uint64_t SSEL:1;
      uint64_t CREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define IREF (*(volatile struct IREF_tag *) 0x4000c700)

struct NVIC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISER;

  uint8_t res0[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICER;

  uint8_t res1[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISPR;

  uint8_t res2[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPR;

  uint8_t res3[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IABR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IABR;

  uint8_t res4[252];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_00:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_01:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_02:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_03:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_04:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_05:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_06:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_07:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_08:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_09:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_10:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_12:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_13:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_14:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_16:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_17:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_18:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_19:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_20:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_21:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_22:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_23:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_25:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_26:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_27:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_28:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_29:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_30:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_31:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_32:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_33:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_34:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_35:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_36:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_37:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_38:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_39:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_40:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_41:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_42:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_43:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_44:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_45:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_46:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_47:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_48:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_49:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_50:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_51:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_52:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_53:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_54:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_55:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_56:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_57:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_58:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_59:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_60:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_61:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_62:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_63:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_64:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_65:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_66:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_67:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_68:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_69:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_70:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_71:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_72:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI_73:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IPR73;

