iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res5[2742];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STIR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STIR;

};

#define NVIC (*(volatile struct NVIC_tag *) 0xe000e100)

struct PMU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDOLP:1;
      uint64_t STBMOD:1;
      uint64_t WURST:1;
      uint64_t STBRST:1;
      uint64_t LVDEN:1;
      uint64_t LVDT:3;
      uint64_t BKPWEN:1;
      uint64_t reservedSpace0:1;
      uint64_t LDLP:1;
      uint64_t LDNP:1;
      uint64_t reservedSpace1:2;
      uint64_t LDOVS:2;
      uint64_t HDEN:1;
      uint64_t HDS:1;
      uint64_t LDEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUF:1;
      uint64_t STBF:1;
      uint64_t LVDF:1;
      uint64_t BLDORF:1;
      uint64_t reservedSpace0:4;
      uint64_t WUPEN:1;
      uint64_t BLDOON:1;
      uint64_t reservedSpace1:4;
      uint64_t LDOVSRF:1;
      uint64_t reservedSpace2:1;
      uint64_t HDRF:1;
      uint64_t HDSRF:1;
      uint64_t LDRF:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CS;

};

#define PMU (*(volatile struct PMU_tag *) 0x40007000)

struct RCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRC16MEN:1;
      uint64_t IRC16MSTB:1;
      uint64_t reservedSpace0:1;
      uint64_t IRC16MADJ:5;
      uint64_t IRC16MCALIB:8;
      uint64_t HXTALEN:1;
      uint64_t HXTALSTB:1;
      uint64_t HXTALBPS:1;
      uint64_t CKMEN:1;
      uint64_t reservedSpace1:4;
      uint64_t PLLEN:1;
      uint64_t PLLSTB:1;
      uint64_t PLLI2SEN:1;
      uint64_t PLLI2SSTB:1;
      uint64_t PLLSAIEN:1;
      uint64_t PLLSAISTB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLPSC:6;
      uint64_t PLLN:9;
      uint64_t reservedSpace0:1;
      uint64_t PLLP:2;
      uint64_t reservedSpace1:4;
      uint64_t PLLSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t PLLQ:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCS:2;
      uint64_t SCSS:2;
      uint64_t AHBPSC:4;
      uint64_t reservedSpace0:2;
      uint64_t APB1PSC:3;
      uint64_t APB2PSC:3;
      uint64_t RTCDIV:5;
      uint64_t CKOUT0SEL:2;
      uint64_t I2SSEL:1;
      uint64_t CKOUT0DIV:3;
      uint64_t CKOUT1DIV:3;
      uint64_t CKOUT1SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRC32KSTBIF:1;
      uint64_t LXTALSTBIF:1;
      uint64_t IRC16MSTBIF:1;
      uint64_t HXTALSTBIF:1;
      uint64_t PLLSTBIF:1;
      uint64_t PLLI2SSTBIF:1;
      uint64_t PLLSAISTBIF:1;
      uint64_t CKMIF:1;
      uint64_t IRC32KSTBIE:1;
      uint64_t LXTALSTBIE:1;
      uint64_t IRC16MSTBIE:1;
      uint64_t HXTALSTBIE:1;
      uint64_t PLLSTBIE:1;
      uint64_t PLLI2SSTBIE:1;
      uint64_t PLLSAISTBIE:1;
      uint64_t reservedSpace0:1;
      uint64_t IRC32KSTBIC:1;
      uint64_t LXTALSTBIC:1;
      uint64_t IRC16MSTBIC:1;
      uint64_t HXTALSTBIC:1;
      uint64_t PLLSTBIC:1;
      uint64_t PLLI2SSTBIC:1;
      uint64_t PLLSAISTBIC:1;
      uint64_t CKMIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARST:1;
      uint64_t PBRST:1;
      uint64_t PCRST:1;
      uint64_t PDRST:1;
      uint64_t PERST:1;
      uint64_t PFRST:1;
      uint64_t PGRST:1;
      uint64_t PHRST:1;
      uint64_t PIRST:1;
      uint64_t reservedSpace0:3;
      uint64_t CRCRST:1;
      uint64_t reservedSpace1:8;
      uint64_t DMA0RST:1;
      uint64_t DMA1RST:1;
      uint64_t IPARST:1;
      uint64_t reservedSpace2:1;
      uint64_t ENETRST:1;
      uint64_t reservedSpace3:3;
      uint64_t USBHSRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1RST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCIRST:1;
      uint64_t reservedSpace0:5;
      uint64_t TRNGRST:1;
      uint64_t USBFSRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2RST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3RST;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1RST:1;
      uint64_t TIMER2RST:1;
      uint64_t TIMER3RST:1;
      uint64_t TIMER4RST:1;
      uint64_t TIMER5RST:1;
      uint64_t TIMER6RST:1;
      uint64_t TIMER11RST:1;
      uint64_t TIMER12RST:1;
      uint64_t TIMER13RST:1;
      uint64_t reservedSpace0:2;
      uint64_t WWDGTRST:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI1RST:1;
      uint64_t SPI2RST:1;
      uint64_t reservedSpace2:1;
      uint64_t USART1RST:1;
      uint64_t USART2RST:1;
      uint64_t UART3RST:1;
      uint64_t UART4RST:1;
      uint64_t I2C0RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t reservedSpace3:1;
      uint64_t CAN0RST:1;
      uint64_t CAN1RST:1;
      uint64_t reservedSpace4:1;
      uint64_t PMURST:1;
      uint64_t DACRST:1;
      uint64_t UART6RST:1;
      uint64_t UART7RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0RST:1;
      uint64_t TIMER7RST:1;
      uint64_t reservedSpace0:2;
      uint64_t USART0RST:1;
      uint64_t USART5RST:1;
      uint64_t reservedSpace1:2;
      uint64_t ADCRST:1;
      uint64_t reservedSpace2:2;
      uint64_t SDIORST:1;
      uint64_t SPI0RST:1;
      uint64_t SPI3RST:1;
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace3:1;
      uint64_t TIMER8RST:1;
      uint64_t TIMER9RST:1;
      uint64_t TIMER10RST:1;
      uint64_t reservedSpace4:1;
      uint64_t SPI4RST:1;
      uint64_t SPI5RST:1;
      uint64_t reservedSpace5:4;
      uint64_t TLIRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RST;

