iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAEN:1;
      uint64_t PBEN:1;
      uint64_t PCEN:1;
      uint64_t PDEN:1;
      uint64_t PEEN:1;
      uint64_t PFEN:1;
      uint64_t PGEN:1;
      uint64_t PHEN:1;
      uint64_t PIEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRCEN:1;
      uint64_t reservedSpace1:5;
      uint64_t BKPSRAMEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TCMSRAMEN:1;
      uint64_t DMA0EN:1;
      uint64_t DMA1EN:1;
      uint64_t IPAEN:1;
      uint64_t reservedSpace3:1;
      uint64_t ENETEN:1;
      uint64_t ENETTXEN:1;
      uint64_t ENETRXEN:1;
      uint64_t ENETPTPEN:1;
      uint64_t USBHSEN:1;
      uint64_t USBHSULPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCIEN:1;
      uint64_t reservedSpace0:5;
      uint64_t TRNGEN:1;
      uint64_t USBFSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3EN;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1EN:1;
      uint64_t TIMER2EN:1;
      uint64_t TIMER3EN:1;
      uint64_t TIMER4EN:1;
      uint64_t TIMER5EN:1;
      uint64_t TIMER6EN:1;
      uint64_t TIMER11EN:1;
      uint64_t TIMER12EN:1;
      uint64_t TIMER13EN:1;
      uint64_t reservedSpace0:2;
      uint64_t WWDGTEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI1EN:1;
      uint64_t SPI2EN:1;
      uint64_t reservedSpace2:1;
      uint64_t USART1EN:1;
      uint64_t USART2EN:1;
      uint64_t UART3EN:1;
      uint64_t UART4EN:1;
      uint64_t I2C0EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t reservedSpace3:1;
      uint64_t CAN0EN:1;
      uint64_t CAN1EN:1;
      uint64_t reservedSpace4:1;
      uint64_t PMUEN:1;
      uint64_t DACEN:1;
      uint64_t UART6EN:1;
      uint64_t UART7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0EN:1;
      uint64_t TIMER7EN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART0EN:1;
      uint64_t USART5EN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADC0EN:1;
      uint64_t ADC1EN:1;
      uint64_t ADC2EN:1;
      uint64_t SDIOEN:1;
      uint64_t SPI0EN:1;
      uint64_t SPI3EN:1;
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TIMER8EN:1;
      uint64_t TIMER9EN:1;
      uint64_t TIMER10EN:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI4EN:1;
      uint64_t SPI5EN:1;
      uint64_t reservedSpace4:4;
      uint64_t TLIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2EN;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PASPEN:1;
      uint64_t PBSPEN:1;
      uint64_t PCSPEN:1;
      uint64_t PDSPEN:1;
      uint64_t PESPEN:1;
      uint64_t PFSPEN:1;
      uint64_t PGSPEN:1;
      uint64_t PHSPEN:1;
      uint64_t PISPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRCSPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t FMCSPEN:1;
      uint64_t SRAM0SPEN:1;
      uint64_t SRAM1SPEN:1;
      uint64_t BKPSRAMSPEN:1;
      uint64_t SRAM2SPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DMA0SPEN:1;
      uint64_t DMA1SPEN:1;
      uint64_t IPASPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t ENETSPEN:1;
      uint64_t ENETTXSPEN:1;
      uint64_t ENETRXSPEN:1;
      uint64_t ENETPTPSPEN:1;
      uint64_t USBHSSPEN:1;
      uint64_t USBHSULPISPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1SPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCISPEN:1;
      uint64_t reservedSpace0:5;
      uint64_t TRNGSPEN:1;
      uint64_t USBFSSPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2SPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXMCSPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3SPEN;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1SPEN:1;
      uint64_t TIMER2SPEN:1;
      uint64_t TIMER3SPEN:1;
      uint64_t TIMER4SPEN:1;
      uint64_t TIMER5SPEN:1;
      uint64_t TIMER6SPEN:1;
      uint64_t TIMER11SPEN:1;
      uint64_t TIMER12SPEN:1;
      uint64_t TIMER13SPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t WWDGTSPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI1SPEN:1;
      uint64_t SPI2SPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t USART1SPEN:1;
      uint64_t USART2SPEN:1;
      uint64_t UART3SPEN:1;
      uint64_t UART4SPEN:1;
      uint64_t I2C0SPEN:1;
      uint64_t I2C1SPEN:1;
      uint64_t I2C2SPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t CAN0SPEN:1;
      uint64_t CAN1SPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t PMUSPEN:1;
      uint64_t DACSPEN:1;
      uint64_t UART6SPEN:1;
      uint64_t UART7SPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1SPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0SPEN:1;
      uint64_t TIMER7SPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART0SPEN:1;
      uint64_t USART5SPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADC0SPEN:1;
      uint64_t ADC1SPEN:1;
      uint64_t ADC2SPEN:1;
      uint64_t SDIOSPEN:1;
      uint64_t SPI0SPEN:1;
      uint64_t SPI3SPEN:1;
      uint64_t SYSCFGSPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TIMER8SPEN:1;
      uint64_t TIMER9SPEN:1;
      uint64_t TIMER10SPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI4SPEN:1;
      uint64_t SPI5SPEN:1;
      uint64_t reservedSpace4:4;
      uint64_t TLISPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2SPEN;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LXTALEN:1;
      uint64_t LXTALSTB:1;
      uint64_t LXTALBPS:1;
      uint64_t LXTALDRI:2;
      uint64_t reservedSpace0:3;
      uint64_t RTCSRC:2;
      uint64_t reservedSpace1:5;
      uint64_t RTCEN:1;
      uint64_t BKPRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRC32KEN:1;
      uint64_t IRC32KSTB:1;
      uint64_t reservedSpace0:22;
      uint64_t RSTFC:1;
      uint64_t BORRSTF:1;
      uint64_t EPRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SWRSTF:1;
      uint64_t FWDGTRSTF:1;
      uint64_t WWDGTRSTF:1;
      uint64_t LPRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTSCK;

