iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODCNT:13;
      uint64_t MODSTEP:15;
      uint64_t reservedSpace0:2;
      uint64_t SS_TYPE:1;
      uint64_t SSCGON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSSCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLI2SPSC:6;
      uint64_t PLLI2SN:9;
      uint64_t reservedSpace0:9;
      uint64_t PLLI2SQ:4;
      uint64_t PLLI2SR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLI2S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PLLSAIN:9;
      uint64_t reservedSpace1:1;
      uint64_t PLLSAIP:2;
      uint64_t reservedSpace2:6;
      uint64_t PLLSAIQ:4;
      uint64_t PLLSAIR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSAI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PLLSAIRDIV:2;
      uint64_t reservedSpace1:6;
      uint64_t TIMERSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res7[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CK48MSEL:1;
      uint64_t PLL48MSEL:1;
      uint64_t reservedSpace0:14;
      uint64_t IRC48MEN:1;
      uint64_t IRC48MSTB:1;
      uint64_t reservedSpace1:6;
      uint64_t IRC48MCAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDCTL;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t IRC48MSTBIF:1;
      uint64_t reservedSpace1:7;
      uint64_t IRC48MSTBIE:1;
      uint64_t reservedSpace2:7;
      uint64_t IRC48MSTBIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDINT;

  uint8_t res9[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:27;
      uint64_t CTCRST:1;
      uint64_t reservedSpace1:3;
      uint64_t IREFRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDAPB1RST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:27;
      uint64_t CTCEN:1;
      uint64_t reservedSpace1:3;
      uint64_t IREFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDAPB1EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:27;
      uint64_t CTCSPEN:1;
      uint64_t reservedSpace1:3;
      uint64_t IREFSPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDAPB1SPEN;

  uint8_t res10[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VKEY;

  uint8_t res11[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSLPVS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSV;

};

#define RCU (*(volatile struct RCU_tag *) 0x40023800)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCU:4;
      uint64_t SCT:3;
      uint64_t reservedSpace0:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t reservedSpace1:1;
      uint64_t HRU:4;
      uint64_t HRT:2;
      uint64_t PM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t reservedSpace0:2;
      uint64_t MONU:4;
      uint64_t MONT:1;
      uint64_t DOW:3;
      uint64_t YRU:4;
      uint64_t YRT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTCS:3;
      uint64_t TSEG:1;
      uint64_t REFEN:1;
      uint64_t BPSHAD:1;
      uint64_t CS:1;
      uint64_t CCEN:1;
      uint64_t ALRM0EN:1;
      uint64_t ALRM1EN:1;
      uint64_t WTEN:1;
      uint64_t TSEN:1;
      uint64_t ALRM0IE:1;
      uint64_t ALRM1IE:1;
      uint64_t WTIE:1;
      uint64_t TSIE:1;
      uint64_t A1H:1;
      uint64_t S1H:1;
      uint64_t DSM:1;
      uint64_t COS:1;
      uint64_t OPOL:1;
      uint64_t OS:2;
      uint64_t COEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALRM0WF:1;
      uint64_t ALRM1WF:1;
      uint64_t WTWF:1;
      uint64_t SOPF:1;
      uint64_t YCM:1;
      uint64_t RSYNF:1;
      uint64_t INITF:1;
      uint64_t INITM:1;
      uint64_t ALRM0F:1;
      uint64_t ALRM1F:1;
      uint64_t WTF:1;
      uint64_t TSF:1;
      uint64_t TSOVRF:1;
      uint64_t TP0F:1;
      uint64_t TP1F:1;
      uint64_t reservedSpace0:1;
      uint64_t SCPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FACTOR_S:15;
      uint64_t reservedSpace0:1;
      uint64_t FACTOR_A:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTRV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COSS:5;
      uint64_t reservedSpace0:2;
      uint64_t COSD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCU:4;
      uint64_t SCT:3;
      uint64_t MSKS:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t MSKM:1;
      uint64_t HRU:4;
      uint64_t HRT:2;
      uint64_t PM:1;
      uint64_t MSKH:1;
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t DOWS:1;
      uint64_t MSKD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRM0TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCU:4;
      uint64_t SCT:3;
      uint64_t MSKS:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t MSKM:1;
      uint64_t HRU:4;
      uint64_t HRT:2;
      uint64_t PM:1;
      uint64_t MSKH:1;
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t DOWS:1;
      uint64_t MSKD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRM1TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFS:15;
      uint64_t reservedSpace0:16;
      uint64_t A1S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCU:4;
      uint64_t SCT:3;
      uint64_t reservedSpace0:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t reservedSpace1:1;
      uint64_t HRU:4;
      uint64_t HRT:2;
      uint64_t PM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t reservedSpace0:2;
      uint64_t MONU:4;
      uint64_t MONT:1;
      uint64_t DOW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMSK:9;
      uint64_t reservedSpace0:4;
      uint64_t CWND16:1;
      uint64_t CWND8:1;
      uint64_t FREQI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP0EN:1;
      uint64_t TP0EG:1;
      uint64_t TPIE:1;
      uint64_t TP1EN:1;
      uint64_t TP1EG:1;
      uint64_t reservedSpace0:2;
      uint64_t TPTS:1;
      uint64_t FREQ:3;
      uint64_t FLT:2;
      uint64_t PRCH:2;
      uint64_t DISPU:1;
      uint64_t TP0SEL:1;
      uint64_t TSSEL:1;
      uint64_t AOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSC:15;
      uint64_t reservedSpace0:9;
      uint64_t MSKSSC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRM0SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSC:15;
      uint64_t reservedSpace0:9;
      uint64_t MSKSSC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRM1SS;

