iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP7_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP7_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP19;

};

#define RTC (*(volatile struct RTC_tag *) 0x40002800)

struct SDIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_0_7:8;
      uint64_t CLKEN:1;
      uint64_t CLKPWRSAV:1;
      uint64_t CLKBYP:1;
      uint64_t BUSMODE:2;
      uint64_t CLKEDGE:1;
      uint64_t HWCLKEN:1;
      uint64_t reservedSpace0:16;
      uint64_t DIV_8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDAGMT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDAGMT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDIDX:6;
      uint64_t CMDRESP:2;
      uint64_t INTWAIT:1;
      uint64_t WAITDEND:1;
      uint64_t CSMEN:1;
      uint64_t SUSPEND:1;
      uint64_t ENCMDC:1;
      uint64_t NINTEN:1;
      uint64_t ATAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSPCMDIDX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSPCMDIDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATATO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATATO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALEN:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATALEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAEN:1;
      uint64_t DATADIR:1;
      uint64_t TRANSMOD:1;
      uint64_t DMAEN:1;
      uint64_t BLKSZ:4;
      uint64_t RWEN:1;
      uint64_t RWSTOP:1;
      uint64_t RWTYPE:1;
      uint64_t IOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATACTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATACNT:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATACNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCRCERR:1;
      uint64_t DTCRCERR:1;
      uint64_t CMDTMOUT:1;
      uint64_t DTTMOUT:1;
      uint64_t TXURE:1;
      uint64_t RXORE:1;
      uint64_t CMDRECV:1;
      uint64_t CMDSEND:1;
      uint64_t DTEND:1;
      uint64_t STBITE:1;
      uint64_t DTBLKEND:1;
      uint64_t CMDRUN:1;
      uint64_t TXRUN:1;
      uint64_t RXRUN:1;
      uint64_t TFH:1;
      uint64_t RFH:1;
      uint64_t TFF:1;
      uint64_t RFF:1;
      uint64_t TFE:1;
      uint64_t RFE:1;
      uint64_t TXDTVAL:1;
      uint64_t RXDTVAL:1;
      uint64_t SDIOINT:1;
      uint64_t ATAEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCRCERRC:1;
      uint64_t DTCRCERRC:1;
      uint64_t CMDTMOUTC:1;
      uint64_t DTTMOUTC:1;
      uint64_t TXUREC:1;
      uint64_t RXOREC:1;
      uint64_t CMDRECVC:1;
      uint64_t CMDSENDC:1;
      uint64_t DTENDC:1;
      uint64_t STBITEC:1;
      uint64_t DTBLKENDC:1;
      uint64_t reservedSpace0:11;
      uint64_t SDIOINTC:1;
      uint64_t ATAENDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCRCERRIE:1;
      uint64_t DTCRCERRIE:1;
      uint64_t CMDTMOUTIE:1;
      uint64_t DTTMOUTIE:1;
      uint64_t TXUREIE:1;
      uint64_t RXOREIE:1;
      uint64_t CMDRECVIE:1;
      uint64_t CMDSENDIE:1;
      uint64_t DTENDIE:1;
      uint64_t STBITEIE:1;
      uint64_t DTBLKENDIE:1;
      uint64_t CMDRUNIE:1;
      uint64_t TXRUNIE:1;
      uint64_t RXRUNIE:1;
      uint64_t TFHIE:1;
      uint64_t RFHIE:1;
      uint64_t TFFIE:1;
      uint64_t RFFIE:1;
      uint64_t TFEIE:1;
      uint64_t RFEIE:1;
      uint64_t TXDTVALIE:1;
      uint64_t RXDTVALIE:1;
      uint64_t SDIOINTIE:1;
      uint64_t ATAENDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

