iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define SPI2 (*(volatile struct SPI2_tag *) 0x40003c00)

struct SPI3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKPH:1;
      uint64_t CKPL:1;
      uint64_t MSTMOD:1;
      uint64_t PSC:3;
      uint64_t SPIEN:1;
      uint64_t LF:1;
      uint64_t SWNSS:1;
      uint64_t SWNSSEN:1;
      uint64_t RO:1;
      uint64_t FF16:1;
      uint64_t CRCNT:1;
      uint64_t CRCEN:1;
      uint64_t BDOEN:1;
      uint64_t BDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREN:1;
      uint64_t DMATEN:1;
      uint64_t NSSDRV:1;
      uint64_t reservedSpace0:1;
      uint64_t TMOD:1;
      uint64_t ERRIE:1;
      uint64_t RBNEIE:1;
      uint64_t TBEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t I2SCH:1;
      uint64_t TXURERR:1;
      uint64_t CRCERR:1;
      uint64_t CONFERR:1;
      uint64_t RXORERR:1;
      uint64_t TRANS:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHLEN:1;
      uint64_t DTLEN:2;
      uint64_t CKPL:1;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSMOD:1;
      uint64_t I2SOPMOD:2;
      uint64_t I2SEN:1;
      uint64_t I2SSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t OF:1;
      uint64_t MCKOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SPSC;

};

#define SPI3 (*(volatile struct SPI3_tag *) 0x40013400)

struct SPI4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKPH:1;
      uint64_t CKPL:1;
      uint64_t MSTMOD:1;
      uint64_t PSC:3;
      uint64_t SPIEN:1;
      uint64_t LF:1;
      uint64_t SWNSS:1;
      uint64_t SWNSSEN:1;
      uint64_t RO:1;
      uint64_t FF16:1;
      uint64_t CRCNT:1;
      uint64_t CRCEN:1;
      uint64_t BDOEN:1;
      uint64_t BDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREN:1;
      uint64_t DMATEN:1;
      uint64_t NSSDRV:1;
      uint64_t reservedSpace0:1;
      uint64_t TMOD:1;
      uint64_t ERRIE:1;
      uint64_t RBNEIE:1;
      uint64_t TBEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t I2SCH:1;
      uint64_t TXURERR:1;
      uint64_t CRCERR:1;
      uint64_t CONFERR:1;
      uint64_t RXORERR:1;
      uint64_t TRANS:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHLEN:1;
      uint64_t DTLEN:2;
      uint64_t CKPL:1;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSMOD:1;
      uint64_t I2SOPMOD:2;
      uint64_t I2SEN:1;
      uint64_t I2SSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t OF:1;
      uint64_t MCKOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SPSC;

};

#define SPI4 (*(volatile struct SPI4_tag *) 0x40015000)

struct SPI5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKPH:1;
      uint64_t CKPL:1;
      uint64_t MSTMOD:1;
      uint64_t PSC:3;
      uint64_t SPIEN:1;
      uint64_t LF:1;
      uint64_t SWNSS:1;
      uint64_t SWNSSEN:1;
      uint64_t RO:1;
      uint64_t FF16:1;
      uint64_t CRCNT:1;
      uint64_t CRCEN:1;
      uint64_t BDOEN:1;
      uint64_t BDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREN:1;
      uint64_t DMATEN:1;
      uint64_t NSSDRV:1;
      uint64_t reservedSpace0:1;
      uint64_t TMOD:1;
      uint64_t ERRIE:1;
      uint64_t RBNEIE:1;
      uint64_t TBEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t I2SCH:1;
      uint64_t TXURERR:1;
      uint64_t CRCERR:1;
      uint64_t CONFERR:1;
      uint64_t RXORERR:1;
      uint64_t TRANS:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHLEN:1;
      uint64_t DTLEN:2;
      uint64_t CKPL:1;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSMOD:1;
      uint64_t I2SOPMOD:2;
      uint64_t I2SEN:1;
      uint64_t I2SSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t OF:1;
      uint64_t MCKOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SPSC;

