iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res0[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QMOD:1;
      uint64_t QRD:1;
      uint64_t IO23_DRV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QCTL;

};

#define SPI5 (*(volatile struct SPI5_tag *) 0x40015400)

struct I2S1_add_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKPH:1;
      uint64_t CKPL:1;
      uint64_t MSTMOD:1;
      uint64_t PSC:3;
      uint64_t SPIEN:1;
      uint64_t LF:1;
      uint64_t SWNSS:1;
      uint64_t SWNSSEN:1;
      uint64_t RO:1;
      uint64_t FF16:1;
      uint64_t CRCNT:1;
      uint64_t CRCEN:1;
      uint64_t BDOEN:1;
      uint64_t BDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREN:1;
      uint64_t DMATEN:1;
      uint64_t NSSDRV:1;
      uint64_t reservedSpace0:1;
      uint64_t TMOD:1;
      uint64_t ERRIE:1;
      uint64_t RBNEIE:1;
      uint64_t TBEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t I2SCH:1;
      uint64_t TXURERR:1;
      uint64_t CRCERR:1;
      uint64_t CONFERR:1;
      uint64_t RXORERR:1;
      uint64_t TRANS:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHLEN:1;
      uint64_t DTLEN:2;
      uint64_t CKPL:1;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSMOD:1;
      uint64_t I2SOPMOD:2;
      uint64_t I2SEN:1;
      uint64_t I2SSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t OF:1;
      uint64_t MCKOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SPSC;

};

#define I2S1_add (*(volatile struct I2S1_add_tag *) 0x40003400)

struct I2S2_add_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKPH:1;
      uint64_t CKPL:1;
      uint64_t MSTMOD:1;
      uint64_t PSC:3;
      uint64_t SPIEN:1;
      uint64_t LF:1;
      uint64_t SWNSS:1;
      uint64_t SWNSSEN:1;
      uint64_t RO:1;
      uint64_t FF16:1;
      uint64_t CRCNT:1;
      uint64_t CRCEN:1;
      uint64_t BDOEN:1;
      uint64_t BDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREN:1;
      uint64_t DMATEN:1;
      uint64_t NSSDRV:1;
      uint64_t reservedSpace0:1;
      uint64_t TMOD:1;
      uint64_t ERRIE:1;
      uint64_t RBNEIE:1;
      uint64_t TBEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBNE:1;
      uint64_t TBE:1;
      uint64_t I2SCH:1;
      uint64_t TXURERR:1;
      uint64_t CRCERR:1;
      uint64_t CONFERR:1;
      uint64_t RXORERR:1;
      uint64_t TRANS:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHLEN:1;
      uint64_t DTLEN:2;
      uint64_t CKPL:1;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSMOD:1;
      uint64_t I2SOPMOD:2;
      uint64_t I2SEN:1;
      uint64_t I2SSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t OF:1;
      uint64_t MCKOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SPSC;

};

#define I2S2_add (*(volatile struct I2S2_add_tag *) 0x40004000)

struct SYSCFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOT_MODE:3;
      uint64_t reservedSpace0:5;
      uint64_t FMC_SWP:1;
      uint64_t reservedSpace1:1;
      uint64_t EXMC_SWP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t ENET_PHY_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0_SS:4;
      uint64_t EXTI1_SS:4;
      uint64_t EXTI2_SS:4;
      uint64_t EXTI3_SS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTISS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4_SS:4;
      uint64_t EXTI5_SS:4;
      uint64_t EXTI6_SS:4;
      uint64_t EXTI7_SS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTISS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI8_SS:4;
      uint64_t EXTI9_SS:4;
      uint64_t EXTI10_SS:4;
      uint64_t EXTI11_SS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTISS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI12_SS:4;
      uint64_t EXTI13_SS:4;
      uint64_t EXTI14_SS:4;
      uint64_t EXTI15_SS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTISS3;

