iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t CPS_RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSCTL;

};

#define SYSCFG (*(volatile struct SYSCFG_tag *) 0x40013800)

struct TIMER5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UPDIS:1;
      uint64_t UPS:1;
      uint64_t SPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MMC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPIE:1;
      uint64_t reservedSpace0:7;
      uint64_t UPDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWEVG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAR;

};

#define TIMER5 (*(volatile struct TIMER5_tag *) 0x40001000)

struct TIMER6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UPDIS:1;
      uint64_t UPS:1;
      uint64_t SPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MMC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPIE:1;
      uint64_t reservedSpace0:7;
      uint64_t UPDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWEVG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAR;

};

#define TIMER6 (*(volatile struct TIMER6_tag *) 0x40001400)

struct TLI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VPSZ:12;
      uint64_t reservedSpace0:4;
      uint64_t HPSZ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBPSZ:12;
      uint64_t reservedSpace0:4;
      uint64_t HBPSZ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VASZ:12;
      uint64_t reservedSpace0:4;
      uint64_t HASZ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VTSZ:12;
      uint64_t reservedSpace0:4;
      uint64_t HTSZ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLIEN:1;
      uint64_t reservedSpace0:3;
      uint64_t BDB:3;
      uint64_t reservedSpace1:1;
      uint64_t GDB:3;
      uint64_t reservedSpace2:1;
      uint64_t RDB:3;
      uint64_t reservedSpace3:1;
      uint64_t DFEN:1;
      uint64_t reservedSpace4:11;
      uint64_t CLKPS:1;
      uint64_t DEPS:1;
      uint64_t VPPS:1;
      uint64_t HPPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RQR:1;
      uint64_t FBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BVB:8;
      uint64_t BVG:8;
      uint64_t BVR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BGC;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMIE:1;
      uint64_t FEIE:1;
      uint64_t TEIE:1;
      uint64_t LCRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMF:1;
      uint64_t FEF:1;
      uint64_t TEF:1;
      uint64_t LCRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMC:1;
      uint64_t FEC:1;
      uint64_t TEC:1;
      uint64_t LCRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VPOS:16;
      uint64_t HPOS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDE:1;
      uint64_t HDE:1;
      uint64_t VS:1;
      uint64_t HS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  uint8_t res3[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEN:1;
      uint64_t CKEYEN:1;
      uint64_t reservedSpace0:2;
      uint64_t LUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLP:12;
      uint64_t reservedSpace0:4;
      uint64_t WRP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0HPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTP:12;
      uint64_t reservedSpace0:4;
      uint64_t WBP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0VPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKEYB:8;
      uint64_t CKEYG:8;
      uint64_t CKEYR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0CKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0PPF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0SA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCB:8;
      uint64_t DCG:8;
      uint64_t DCR:8;
      uint64_t DCA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0DC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACF2:3;
      uint64_t reservedSpace0:5;
      uint64_t ACF1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0BLEND;

