iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0FBADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:14;
      uint64_t reservedSpace0:2;
      uint64_t STDOFF:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0FLLEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTLN:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0FTLN;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TB:8;
      uint64_t TG:8;
      uint64_t TR:8;
      uint64_t TADD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L0LUT;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEN:1;
      uint64_t CKEYEN:1;
      uint64_t reservedSpace0:2;
      uint64_t LUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLP:12;
      uint64_t reservedSpace0:4;
      uint64_t WRP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1HPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTP:12;
      uint64_t reservedSpace0:4;
      uint64_t WBP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1VPOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKEYB:8;
      uint64_t CKEYG:8;
      uint64_t CKEYR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1PPF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1SA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCB:8;
      uint64_t DCG:8;
      uint64_t DCR:8;
      uint64_t DCA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1DC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACF2:3;
      uint64_t reservedSpace0:5;
      uint64_t ACF1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1BLEND;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1FBADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:14;
      uint64_t reservedSpace0:2;
      uint64_t STDOFF:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1FLLEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTLN:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1FTLN;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TB:8;
      uint64_t TG:8;
      uint64_t TR:8;
      uint64_t TADD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1LUT;

};

#define TLI (*(volatile struct TLI_tag *) 0x40016808)

struct TRNG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TRNGEN:1;
      uint64_t IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRDY:1;
      uint64_t CECS:1;
      uint64_t SECS:1;
      uint64_t reservedSpace0:2;
      uint64_t CEIF:1;
      uint64_t SEIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

};

#define TRNG (*(volatile struct TRNG_tag *) 0x50060800)

struct USART0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t NERR:1;
      uint64_t ORERR:1;
      uint64_t IDLEF:1;
      uint64_t RBNE:1;
      uint64_t TC:1;
      uint64_t TBE:1;
      uint64_t LBDF:1;
      uint64_t CTSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADIV:4;
      uint64_t INTDIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBKCMD:1;
      uint64_t RWU:1;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t IDLEIE:1;
      uint64_t RBNEIE:1;
      uint64_t TCIE:1;
      uint64_t TBEIE:1;
      uint64_t PERRIE:1;
      uint64_t PM:1;
      uint64_t PCEN:1;
      uint64_t WM:1;
      uint64_t WL:1;
      uint64_t UEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:4;
      uint64_t reservedSpace0:1;
      uint64_t LBLEN:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CLEN:1;
      uint64_t CPH:1;
      uint64_t CPL:1;
      uint64_t CKEN:1;
      uint64_t STB:2;
      uint64_t LMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDEN:1;
      uint64_t NKEN:1;
      uint64_t SCEN:1;
      uint64_t DENR:1;
      uint64_t DENT:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
      uint64_t CTSIE:1;
      uint64_t OSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GUAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTEN:1;
      uint64_t SCRTNUM:3;
      uint64_t RTIE:1;
      uint64_t EBIE:1;
      uint64_t reservedSpace0:2;
      uint64_t RINV:1;
      uint64_t TINV:1;
      uint64_t DINV:1;
      uint64_t MSBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RT:24;
      uint64_t BL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t RTF:1;
      uint64_t EBF:1;
      uint64_t reservedSpace1:3;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  uint8_t res2[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCM:1;
      uint64_t PCM:1;
      uint64_t BCM:1;
      uint64_t reservedSpace0:5;
      uint64_t EPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHC;

