iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define USART2 (*(volatile struct USART2_tag *) 0x40004800)

struct USART5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t NERR:1;
      uint64_t ORERR:1;
      uint64_t IDLEF:1;
      uint64_t RBNE:1;
      uint64_t TC:1;
      uint64_t TBE:1;
      uint64_t LBDF:1;
      uint64_t CTSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADIV:4;
      uint64_t INTDIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBKCMD:1;
      uint64_t RWU:1;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t IDLEIE:1;
      uint64_t RBNEIE:1;
      uint64_t TCIE:1;
      uint64_t TBEIE:1;
      uint64_t PERRIE:1;
      uint64_t PM:1;
      uint64_t PCEN:1;
      uint64_t WM:1;
      uint64_t WL:1;
      uint64_t UEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:4;
      uint64_t reservedSpace0:1;
      uint64_t LBLEN:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CLEN:1;
      uint64_t CPH:1;
      uint64_t CPL:1;
      uint64_t CKEN:1;
      uint64_t STB:2;
      uint64_t LMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDEN:1;
      uint64_t NKEN:1;
      uint64_t SCEN:1;
      uint64_t DENR:1;
      uint64_t DENT:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
      uint64_t CTSIE:1;
      uint64_t OSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GUAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTEN:1;
      uint64_t SCRTNUM:3;
      uint64_t RTIE:1;
      uint64_t EBIE:1;
      uint64_t reservedSpace0:2;
      uint64_t RINV:1;
      uint64_t TINV:1;
      uint64_t DINV:1;
      uint64_t MSBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RT:24;
      uint64_t BL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t RTF:1;
      uint64_t EBF:1;
      uint64_t reservedSpace1:3;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  uint8_t res2[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCM:1;
      uint64_t PCM:1;
      uint64_t BCM:1;
      uint64_t reservedSpace0:5;
      uint64_t EPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHC;

};

#define USART5 (*(volatile struct USART5_tag *) 0x40011400)

struct UART3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t NERR:1;
      uint64_t ORERR:1;
      uint64_t IDLEF:1;
      uint64_t RBNE:1;
      uint64_t TC:1;
      uint64_t TBE:1;
      uint64_t LBDF:1;
      uint64_t CTSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADIV:4;
      uint64_t INTDIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBKCMD:1;
      uint64_t RWU:1;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t IDLEIE:1;
      uint64_t RBNEIE:1;
      uint64_t TCIE:1;
      uint64_t TBEIE:1;
      uint64_t PERRIE:1;
      uint64_t PM:1;
      uint64_t PCEN:1;
      uint64_t WM:1;
      uint64_t WL:1;
      uint64_t UEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:4;
      uint64_t reservedSpace0:1;
      uint64_t LBLEN:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CLEN:1;
      uint64_t CPH:1;
      uint64_t CPL:1;
      uint64_t CKEN:1;
      uint64_t STB:2;
      uint64_t LMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDEN:1;
      uint64_t NKEN:1;
      uint64_t SCEN:1;
      uint64_t DENR:1;
      uint64_t DENT:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
      uint64_t CTSIE:1;
      uint64_t OSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GUAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP;

  uint8_t res1[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCM:1;
      uint64_t PCM:1;
      uint64_t BCM:1;
      uint64_t reservedSpace0:5;
      uint64_t EPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHC;

};

#define UART3 (*(volatile struct UART3_tag *) 0x40004c00)

struct UART4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t NERR:1;
      uint64_t ORERR:1;
      uint64_t IDLEF:1;
      uint64_t RBNE:1;
      uint64_t TC:1;
      uint64_t TBE:1;
      uint64_t LBDF:1;
      uint64_t CTSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADIV:4;
      uint64_t INTDIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBKCMD:1;
      uint64_t RWU:1;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t IDLEIE:1;
      uint64_t RBNEIE:1;
      uint64_t TCIE:1;
      uint64_t TBEIE:1;
      uint64_t PERRIE:1;
      uint64_t PM:1;
      uint64_t PCEN:1;
      uint64_t WM:1;
      uint64_t WL:1;
      uint64_t UEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:4;
      uint64_t reservedSpace0:1;
      uint64_t LBLEN:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CLEN:1;
      uint64_t CPH:1;
      uint64_t CPL:1;
      uint64_t CKEN:1;
      uint64_t STB:2;
      uint64_t LMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDEN:1;
      uint64_t NKEN:1;
      uint64_t SCEN:1;
      uint64_t DENR:1;
      uint64_t DENT:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
      uint64_t CTSIE:1;
      uint64_t OSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

