iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GUAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP;

  uint8_t res1[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCM:1;
      uint64_t PCM:1;
      uint64_t BCM:1;
      uint64_t reservedSpace0:5;
      uint64_t EPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHC;

};

#define UART4 (*(volatile struct UART4_tag *) 0x40005000)

struct UART6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t NERR:1;
      uint64_t ORERR:1;
      uint64_t IDLEF:1;
      uint64_t RBNE:1;
      uint64_t TC:1;
      uint64_t TBE:1;
      uint64_t LBDF:1;
      uint64_t CTSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADIV:4;
      uint64_t INTDIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBKCMD:1;
      uint64_t RWU:1;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t IDLEIE:1;
      uint64_t RBNEIE:1;
      uint64_t TCIE:1;
      uint64_t TBEIE:1;
      uint64_t PERRIE:1;
      uint64_t PM:1;
      uint64_t PCEN:1;
      uint64_t WM:1;
      uint64_t WL:1;
      uint64_t UEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:4;
      uint64_t reservedSpace0:1;
      uint64_t LBLEN:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CLEN:1;
      uint64_t CPH:1;
      uint64_t CPL:1;
      uint64_t CKEN:1;
      uint64_t STB:2;
      uint64_t LMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDEN:1;
      uint64_t NKEN:1;
      uint64_t SCEN:1;
      uint64_t DENR:1;
      uint64_t DENT:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
      uint64_t CTSIE:1;
      uint64_t OSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GUAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP;

  uint8_t res1[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCM:1;
      uint64_t PCM:1;
      uint64_t BCM:1;
      uint64_t reservedSpace0:5;
      uint64_t EPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHC;

};

#define UART6 (*(volatile struct UART6_tag *) 0x40007800)

struct UART7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t NERR:1;
      uint64_t ORERR:1;
      uint64_t IDLEF:1;
      uint64_t RBNE:1;
      uint64_t TC:1;
      uint64_t TBE:1;
      uint64_t LBDF:1;
      uint64_t CTSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADIV:4;
      uint64_t INTDIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBKCMD:1;
      uint64_t RWU:1;
      uint64_t REN:1;
      uint64_t TEN:1;
      uint64_t IDLEIE:1;
      uint64_t RBNEIE:1;
      uint64_t TCIE:1;
      uint64_t TBEIE:1;
      uint64_t PERRIE:1;
      uint64_t PM:1;
      uint64_t PCEN:1;
      uint64_t WM:1;
      uint64_t WL:1;
      uint64_t UEN:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:4;
      uint64_t reservedSpace0:1;
      uint64_t LBLEN:1;
      uint64_t LBDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CLEN:1;
      uint64_t CPH:1;
      uint64_t CPL:1;
      uint64_t CKEN:1;
      uint64_t STB:2;
      uint64_t LMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t IREN:1;
      uint64_t IRLP:1;
      uint64_t HDEN:1;
      uint64_t NKEN:1;
      uint64_t SCEN:1;
      uint64_t DENR:1;
      uint64_t DENT:1;
      uint64_t RTSEN:1;
      uint64_t CTSEN:1;
      uint64_t CTSIE:1;
      uint64_t OSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:8;
      uint64_t GUAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP;

  uint8_t res1[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCM:1;
      uint64_t PCM:1;
      uint64_t BCM:1;
      uint64_t reservedSpace0:5;
      uint64_t EPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHC;

};

#define UART7 (*(volatile struct UART7_tag *) 0x40007c00)

struct FS_HOST_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRNUM:16;
      uint64_t FRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFINFR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTXFS:16;
      uint64_t PTXREQS:8;
      uint64_t PTXREQT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPTFQSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HACHINT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HACHINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CINTEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HACHINTEN;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCST:1;
      uint64_t PCD:1;
      uint64_t PE:1;
      uint64_t PEDC:1;
      uint64_t reservedSpace0:2;
      uint64_t PREM:1;
      uint64_t PSP:1;
      uint64_t PRST:1;
      uint64_t reservedSpace1:1;
      uint64_t PLST:2;
      uint64_t PP:1;
      uint64_t reservedSpace2:4;
      uint64_t PS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPCS;

  uint8_t res2[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0CTL;

