iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0LEN;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1CTL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1LEN;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2CTL;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2LEN;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3CTL;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3LEN;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4CTL;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4LEN;

