iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5CTL;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5LEN;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6CTL;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6LEN;

  uint8_t res16[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7CTL;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t reservedSpace0:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t reservedSpace1:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7LEN;

};

#define FS_HOST (*(volatile struct FS_HOST_tag *) 0x50000400)

struct FS_DEVICE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS:2;
      uint64_t NZLSOH:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:7;
      uint64_t EOPFT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWKUP:1;
      uint64_t SD:1;
      uint64_t GINS:1;
      uint64_t GONS:1;
      uint64_t reservedSpace0:3;
      uint64_t SGINAK:1;
      uint64_t CGINAK:1;
      uint64_t SGONAK:1;
      uint64_t CGONAK:1;
      uint64_t POIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPST:1;
      uint64_t ES:2;
      uint64_t reservedSpace0:5;
      uint64_t FNRSOF:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFEN:1;
      uint64_t EPDISEN:1;
      uint64_t reservedSpace0:1;
      uint64_t CITOEN:1;
      uint64_t EPTXFUDEN:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNEEN:1;
      uint64_t TXFEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFEN:1;
      uint64_t EPDISEN:1;
      uint64_t reservedSpace0:1;
      uint64_t STPFEN:1;
      uint64_t EPRXFOVREN:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPITB:4;
      uint64_t reservedSpace0:12;
      uint64_t OEPITB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAEPINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPIE:4;
      uint64_t reservedSpace0:12;
      uint64_t OEPIE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAEPINTEN;

