iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVBUSDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVBUSDT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVBUSPT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVBUSPT;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTXFEIE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPFEINTEN;

  uint8_t res3[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:2;
      uint64_t reservedSpace0:13;
      uint64_t EPACT:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace2:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0CTL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0INTF;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:7;
      uint64_t reservedSpace0:12;
      uint64_t PCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0LEN;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0TFSTAT;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1CTL;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1INTF;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1LEN;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1TFSTAT;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2CTL;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2INTF;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2LEN;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2TFSTAT;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3CTL;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3INTF;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3LEN;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3TFSTAT;

  uint8_t res19[388];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:2;
      uint64_t reservedSpace0:13;
      uint64_t EPACT:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace2:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0CTL;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0INTF;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:7;
      uint64_t reservedSpace0:12;
      uint64_t PCNT:1;
      uint64_t reservedSpace1:9;
      uint64_t STPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0LEN;

  uint8_t res22[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1CTL;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1INTF;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1LEN;

  uint8_t res25[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2CTL;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2INTF;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2LEN;

  uint8_t res28[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3CTL;

