iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3INTF;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3LEN;

};

#define FS_DEVICE (*(volatile struct FS_DEVICE_tag *) 0x50000800)

struct FS_PWRCLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUCLK:1;
      uint64_t SHCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCLKCTL;

};

#define FS_PWRCLK (*(volatile struct FS_PWRCLK_tag *) 0x50000e00)

struct HS_HOST_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SPDFSLS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRNUM:16;
      uint64_t FRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFINFR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTXFS:16;
      uint64_t PTXREQS:8;
      uint64_t PTXREQT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPTFQSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HACHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HACHINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CINTEN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HACHINTEN;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCST:1;
      uint64_t PCD:1;
      uint64_t PE:1;
      uint64_t PEDC:1;
      uint64_t reservedSpace0:2;
      uint64_t PREM:1;
      uint64_t PSP:1;
      uint64_t PRST:1;
      uint64_t reservedSpace1:1;
      uint64_t PLST:2;
      uint64_t PP:1;
      uint64_t reservedSpace2:4;
      uint64_t PS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPCS;

  uint8_t res2[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH0DMAADDR;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH1DMAADDR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH2DMAADDR;

