iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH3DMAADDR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH4DMAADDR;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH5DMAADDR;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH6DMAADDR;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH7DMAADDR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH8CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH8STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH8INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH8INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH8LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH8DMAADDR;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH9CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH9STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH9INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH9INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH9LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH9DMAADDR;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH10CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH10STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH10INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH10INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH10LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH10DMAADDR;

  uint8_t res13[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSD:1;
      uint64_t EPTYPE:2;
      uint64_t MPC:2;
      uint64_t DAR:7;
      uint64_t ODDFRM:1;
      uint64_t CDIS:1;
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH11CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR:7;
      uint64_t HADDR:7;
      uint64_t ISOPCE:2;
      uint64_t CSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH11STCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t CH:1;
      uint64_t DMAER:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t USBER:1;
      uint64_t BBER:1;
      uint64_t REQOVR:1;
      uint64_t DTER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH11INTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t CHIE:1;
      uint64_t DMAERIE:1;
      uint64_t STALLIE:1;
      uint64_t NAKIE:1;
      uint64_t ACKIE:1;
      uint64_t NYETIE:1;
      uint64_t USBERIE:1;
      uint64_t BBERIE:1;
      uint64_t REQOVRIE:1;
      uint64_t DTERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH11INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t DPID:2;
      uint64_t PING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH11LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCH11DMAADDR;

