iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
};

#define HS_HOST (*(volatile struct HS_HOST_tag *) 0x40040400)

struct HS_DEVICE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS:2;
      uint64_t NZLSOH:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:7;
      uint64_t EOPFT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWKUP:1;
      uint64_t SD:1;
      uint64_t GINS:1;
      uint64_t GONS:1;
      uint64_t reservedSpace0:3;
      uint64_t SGINAK:1;
      uint64_t CGINAK:1;
      uint64_t SGONAK:1;
      uint64_t CGONAK:1;
      uint64_t POIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPST:1;
      uint64_t ES:2;
      uint64_t reservedSpace0:5;
      uint64_t FNRSOF:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFEN:1;
      uint64_t EPDISEN:1;
      uint64_t reservedSpace0:1;
      uint64_t CITOEN:1;
      uint64_t EPTXFUDEN:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNEEN:1;
      uint64_t TXFEEN:1;
      uint64_t reservedSpace2:5;
      uint64_t NAKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFEN:1;
      uint64_t EPDISEN:1;
      uint64_t reservedSpace0:1;
      uint64_t STPFEN:1;
      uint64_t EPRXFOVREN:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTPEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NYETEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPITB:6;
      uint64_t reservedSpace0:10;
      uint64_t OEPITB:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAEPINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPIE:6;
      uint64_t reservedSpace0:10;
      uint64_t OEPIE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAEPINTEN;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVBUSDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVBUSDT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVBUSPT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVBUSPT;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTXFEIE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPFEINTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t IEP1INT:1;
      uint64_t reservedSpace1:15;
      uint64_t OEP1INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEP1INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t IEP1INTEN:1;
      uint64_t reservedSpace1:15;
      uint64_t OEP1INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEP1INTEN;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFEN:1;
      uint64_t EPDISEN:1;
      uint64_t reservedSpace0:1;
      uint64_t CITOEN:1;
      uint64_t EPTXFUDEN:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNEEN:1;
      uint64_t reservedSpace2:6;
      uint64_t NAKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1INTEN;

  uint8_t res4[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFEN:1;
      uint64_t EPDISEN:1;
      uint64_t reservedSpace0:1;
      uint64_t STPFEN:1;
      uint64_t EPRXFOVREN:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTPEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NYETEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1INTEN;

  uint8_t res5[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:2;
      uint64_t reservedSpace0:13;
      uint64_t EPACT:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace2:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0CTL;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
      uint64_t reservedSpace2:5;
      uint64_t NAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0INTF;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:7;
      uint64_t reservedSpace0:12;
      uint64_t PCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0TFSTAT;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1CTL;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
      uint64_t reservedSpace2:5;
      uint64_t NAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1INTF;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t MCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1TFSTAT;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2CTL;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
      uint64_t reservedSpace2:5;
      uint64_t NAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2INTF;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t MCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2TFSTAT;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3CTL;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
      uint64_t reservedSpace2:5;
      uint64_t NAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3INTF;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t MCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3TFSTAT;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP4CTL;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
      uint64_t reservedSpace2:5;
      uint64_t NAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP4INTF;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t MCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP4LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP4DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP4TFSTAT;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP5CTL;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t CITO:1;
      uint64_t EPTXFUD:1;
      uint64_t reservedSpace1:1;
      uint64_t IEPNE:1;
      uint64_t TXFE:1;
      uint64_t reservedSpace2:5;
      uint64_t NAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP5INTF;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t MCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP5LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP5DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPTFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP5TFSTAT;

  uint8_t res23[324];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:2;
      uint64_t reservedSpace0:13;
      uint64_t EPACT:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace2:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0CTL;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
      uint64_t reservedSpace2:7;
      uint64_t NYET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0INTF;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:7;
      uint64_t reservedSpace0:12;
      uint64_t PCNT:1;
      uint64_t reservedSpace1:9;
      uint64_t STPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP0DMAADDR;

  uint8_t res26[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1CTL;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
      uint64_t reservedSpace2:7;
      uint64_t NYET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1INTF;

