iSYSTEMLabs/winIDEAExampleWorkspaces/GigaDevice/GD32F407/emptyTargetInit/GD32F407_sfr.h
  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP1DMAADDR;

  uint8_t res29[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2CTL;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
      uint64_t reservedSpace2:7;
      uint64_t NYET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2INTF;

  uint8_t res31[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2DMAADDR;

  uint8_t res32[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3CTL;

  uint8_t res33[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
      uint64_t reservedSpace2:7;
      uint64_t NYET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3INTF;

  uint8_t res34[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3DMAADDR;

  uint8_t res35[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4CTL;

  uint8_t res36[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
      uint64_t reservedSpace2:7;
      uint64_t NYET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4INTF;

  uint8_t res37[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4DMAADDR;

  uint8_t res38[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPL:11;
      uint64_t reservedSpace0:4;
      uint64_t EPACT:1;
      uint64_t EOFRM_DPID:1;
      uint64_t NAKS:1;
      uint64_t EPTYPE:2;
      uint64_t SNOOP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID_SEVENFRM:1;
      uint64_t SD1PID_SODDFRM:1;
      uint64_t EPD:1;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5CTL;

  uint8_t res39[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF:1;
      uint64_t EPDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t STPF:1;
      uint64_t EPRXFOVR:1;
      uint64_t reservedSpace1:1;
      uint64_t BTBSTP:1;
      uint64_t reservedSpace2:7;
      uint64_t NYET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5INTF;

  uint8_t res40[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLEN:19;
      uint64_t PCNT:10;
      uint64_t STPCNT_RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5LEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5DMAADDR;

};

#define HS_DEVICE (*(volatile struct HS_DEVICE_tag *) 0x40040800)

struct HS_PWRCLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUCLK:1;
      uint64_t SHCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCLKCTL;

};

#define HS_PWRCLK (*(volatile struct HS_PWRCLK_tag *) 0x40040e00)

struct WWDGT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:7;
      uint64_t WDGTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WIN:7;
      uint64_t PSC:2;
      uint64_t EWIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define WWDGT (*(volatile struct WWDGT_tag *) 0x40002c00)

